<?xml version="1.0"?>
<rss version="2.0">
  <channel>
    <title>DouO's Blog</title>
    <description>DouO's Blog</description>
    <link>https://douo.github.io/moon-2013/</link>
    <pubDate>2014-05-05</pubDate>
    <item>
      <title>&#x7678;&#x5DF3;&#x5E74;&#x5C0F;&#x7ED3;</title>
      <link>https://douo.github.io/moon-2013//2014/02/05/the-year-of-the-snake</link>
      <pubDate>2014-02-05</pubDate>
      <description>&lt;p&gt;&#x53BB;&#x5E74;5&#x6708;&#x4EFD;&#x7684;&#x65F6;&#x5019;&#x65E5;&#x6DD8;&#x4E86;&#x4E00;&#x53F0; KPW&#xFF0C;&#x4F46;&#x5982;&#x4ECA;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x53BB;&#x5E74;&#x5230;&#x73B0;&#x5728;&#x597D;&#x50CF;&#x4E5F;&#x6CA1;&#x8BFB;&#x5B8C;&#x591A;&#x5C11;&#x4E66;&#x3002;&#x770B;&#x4E86;&#x4E0D;&#x5C11;&#x798F;&#x5C14;&#x6469;&#x65AF;&#xFF0C;&#x4E00;&#x4E9B;&#x80E1;&#x9002;&#x7684;&#x4E66;&#xFF0C;&#x8FD8;&#x6709;&#x6F2B;&#x753B;&#x2014;&#x2014;&#x8FDB;&#x51FB;&#x7684;&#x5DE8;&#x4EBA;&#x3002;&#x5C0F;&#x8BF4;&#x8FD8;&#x770B;&#x4E86;&#x52A8;&#x7269;&#x519C;&#x573A;&#x3001;&#x672A;&#x592E;&#x6B4C;&#x3002;&#x6700;&#x8FD1;&#x8FD8;&#x770B;&#x4E86;&#x4E00;&#x672C;&#x7ED3;&#x6784;&#x5316;&#x62D6;&#x5EF6;&#x6CD5;&#x3002;&#x5B9E;&#x4F53;&#x4E66;&#x597D;&#x50CF;&#x4E00;&#x672C;&#x4E5F;&#x6CA1;&#x6709;&#x8BFB;&#x5B8C;&#xFF0C;&#x770B;&#x6765;&#x770B;&#x4E86;&#x90A3;&#x4E48;&#x4E9B;&#x62D6;&#x5EF6;&#x75C7;&#x7684;&#x4E66;&#x6211;&#x7684;&#x62D6;&#x5EF6;&#x75C7;&#x8FD8;&#x662F;&#x4E00;&#x70B9;&#x4E5F;&#x6CA1;&#x6709;&#x7F13;&#x89E3;&#xFF0C;&#x4E0D;&#x8FC7;&#x5FC3;&#x6001;&#x4E0A;&#x5012;&#x662F;&#x53D8;&#x5F97;&#x65E0;&#x6240;&#x8C13;&#x4E86;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x8FD9;&#x4E9B;&#x4E66;&#x7684;&#x6B63;&#x9762;&#x4F5C;&#x7528;&#x5427;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x53BB;&#x5E74;&#x770B;&#x4E86;&#x591A;&#x5C11;&#x4E66;&#x6CA1;&#x6709;&#x4F5C;&#x8BB0;&#x5F55;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x5F88;&#x56F0;&#x96BE;&#xFF0C;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x8BB0;&#x5F55;&#x7684;&#x4E1C;&#x897F;&#x771F;&#x662F;&#x5F88;&#x53EF;&#x60DC;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6211;&#x8BFB;&#x4E66;&#x8FD8;&#x6709;&#x4E2A;&#x602A;&#x7656;&#xFF0C;&#x4E00;&#x4E9B;&#x4E66;&#x603B;&#x4E0D;&#x820D;&#x5F97;&#x8BFB;&#x5B8C;&#xFF0C;&#x8BFB;&#x5230;&#x6700;&#x540E;&#x4E00;&#x7AE0;&#x5C31;&#x5F97;&#x6B47;&#x4E00;&#x6B47;&#x4FBF;&#x4E0D;&#x518D;&#x8BFB;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x540E;&#x6765;&#x53C8;&#x5F7B;&#x5E95;&#x5FD8;&#x4E86;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x5E74;&#x4E24;&#x5E74;&#x90FD;&#x6CA1;&#x518D;&#x62FF;&#x8D77;&#x6765;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x6709;&#x4E2D;&#x6709;&#x767E;&#x5E74;&#x5B64;&#x72EC;&#xFF0C;&#x672A;&#x592E;&#x6B4C;&#xFF0C;&#x7985;&#x4E0E;&#x6469;&#x6258;&#x8F66;&#x7EF4;&#x4FEE;&#x827A;&#x672F;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x6709;&#x4E2A;&#x4E1C;&#x897F;&#x6765;&#x63D0;&#x9192;&#x5C31;&#x597D;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x53BB;&#x5E74;&#x7ADF;&#x7136;&#x4E00;&#x672C;&#x4E0E; CS &#x76F8;&#x5173;&#x7684;&#x4E66;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x90A3;&#x4ECA;&#x5E74;&#x8981;&#x597D;&#x597D;&#x8865;&#x56DE;&#x6765;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x7EE7;&#x7EED;&#x6253;&#x7262;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#xFF0C;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x8499;&#x5C18;&#x591A;&#x5E74;&#x4E86;&#xFF0C;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x8BA9;&#x5B83;&#x7EE7;&#x7EED;&#x8EBA;&#x5728;&#x4E66;&#x67B6;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4ECA;&#x5E74;&#x8981;&#x8BFB;&#x4E00;&#x672C; CS &#x7684;&#x4E66;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5B83;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E03;&#x5468;&#x4E03;&#x8BED;&#x8A00;&#xFF0C;&#x662F;&#x53E6;&#x4E00;&#x672C;&#x60F3;&#x8BFB;&#x7684;&#x4E66;&#xFF0C;&#x4ECA;&#x5E74;&#x60F3;&#x5B66;&#x4E00;&#x95E8;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x60F3;&#x6765;&#x60F3;&#x53BB;&#x8FD8;&#x662F;&#x82B1;&#x4E0A;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x770B;&#x5B8C;&#x8FD9;&#x90E8;&#x4E66;&#xFF0C;&#x518D;&#x53BB;&#x6311;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x5B9E;&#x5982;&#x679C;&#x80FD;&#x4ED4;&#x7EC6;&#x770B;&#x5B8C;&#x8FD9;&#x672C;&#x4E66;&#x4E5F;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x60F3;&#x5FC5;&#x89C6;&#x91CE;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x5B66;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x672C;&#x4E5F;&#x53EA;&#x662F;&#x7528;&#x6765;&#x5F00;&#x62D3;&#x89C6;&#x91CE;&#x7684;&#x3002;&lt;/p&gt;

&lt;p&gt;Android &#x65B9;&#x9762;&#x80FD;&#x6301;&#x7EED;&#x5173;&#x6CE8;&#x90A3;&#x51E0;&#x4E2A;&#x535A;&#x5BA2;&#xFF0C;&#x90A3;&#x51E0;&#x4E2A; G+ &#x5927;&#x725B;&#xFF0C;&#x90A3;&#x4E9B; youtube &#x4E0A;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x8DDF;&#x5F97;&#x4E0A;&#x65F6;&#x4EE3;&#x5C31;&#x53EF;&#x4EE5;&#x3002;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x9760;&#x505A;&#x9879;&#x76EE;&#x6765;&#x78E8;&#x7EC3;&#x6280;&#x80FD;&#x3002;&#x53E6;&#x5916;&#x5C31;&#x662F;&#x4E89;&#x53D6;&#x5207;&#x6362;&#x5230; Android Studio&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x5426;&#x8981;&#x5207;&#x6362;&#x8FD8;&#x8981;&#x6743;&#x8861;&#x4E0B;&#x5229;&#x5F0A;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x7F51;&#x9875;&#x524D;&#x7AEF;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x60F3;&#x7528;&#x597D;&#x7684;&#xFF0C;&#x6298;&#x817E;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7AD9;&#x603B;&#x662F;&#x62FF;&#x6765;&#x4E3B;&#x4E49;&#xFF0C;&#x5F04;&#x4E45;&#x4E86;&#x4E5F;&#x89C9;&#x5F97;&#x6CA1;&#x610F;&#x601D;&#xFF0C;&#x5BF9; JS&amp;amp;CSS &#x7F3A;&#x5C11;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x60F3;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x529F;&#x80FD;&#x5E38;&#x5E38;&#x89C9;&#x5F97;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#xFF0C;&#x4E5F;&#x6015;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x591F;&#x5730;&#x9053;&#x3002;&lt;/p&gt;

&lt;p&gt;JavaScript: The Good Parts&#xFF0C;&#x53BB;&#x5E74;&#x5F00;&#x4E86;&#x4E2A;&#x5934;&#xFF0C;&#x4ECA;&#x5E74;&#x628A;&#x5B83;&#x8BFB;&#x5B8C;&#x5427;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8FD8;&#x6709; Ruby&#xFF0C;&#x8981;&#x5199;&#x51FA;&#x81EA;&#x5DF1;&#x7B2C;&#x4E00;&#x4E2A; gem &#xFF0C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5DF2;&#x7ECF;&#x5FEB;&#x4E24;&#x5E74;&#x4E86;&#x5427;&#xFF0C;&#x771F;&#x662F;&#x60ED;&#x6127;&#x5440;&#x3002;&#x8FD9;&#x4E2A; gem &#x9700;&#x8981;&#x4E00;&#x4E9B;&#x5929;&#x6587;&#x5B66;&#x77E5;&#x8BC6;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x5148;&#x8981;&#x4FEE;&#x5B8C; Introduction to Astronomy &#xFF0C;&#x867D;&#x7136;&#x73B0;&#x5728;&#x94C1;&#x5B9A;&#x8FC7;&#x4E0D;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;Cousera&#xFF0C;13&#x5E74;&#x662F; Cousera &#x5F00;&#x59CB;&#x6709;&#x70B9;&#x6536;&#x83B7;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x770B;&#x8BFE;&#x7A0B;&#x8BB0;&#x5F55;&#x5E94;&#x8BE5;&#x662F;12&#x5E74;&#x521D;&#x6CE8;&#x518C;&#x7684;&#xFF0C;&#x53EF;&#x76F4;&#x5230;13&#x5E74;9&#x6708;&#x4EFD;&#x7684;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x6211;&#x4E86;&#x7B2C;&#x4E00;&#x95E8;&#x5B8C;&#x6574;&#x7684;&#x8BFE;&#x7A0B;&#x2014;&#x2014;Metadata&#x3002;&#x867D;&#x7136;&#x6700;&#x540E;&#x53EA;&#x6709;75&#x5206;&#xFF0C;&#x4F46;&#x89C6;&#x9891;&#x90FD;&#x770B;&#x4E86;&#xFF0C;&#x4E60;&#x9898;&#x90FD;&#x505A;&#x4E86;&#xFF0C;&#x7B97;&#x662F;&#x5B8C;&#x6574;&#x53C2;&#x4E0E;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x8FD9;&#x6B21;&#x8FC7;&#x4E0D;&#x4E86;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x4E24;&#x4E2A;&#x5355;&#x5143;&#x7684;&#x4E60;&#x9898;&#x8FC7;&#x4E86; deadline&#x3002;&#x5F88;&#x53EF;&#x60DC;&#xFF0C;&#x9898;&#x76EE;&#x90FD;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x7A0D;&#x5FAE;&#x7528;&#x70B9;&#x5FC3;&#x5F88;&#x5BB9;&#x6613;&#x6EE1;&#x5206;&#x7684;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x63A5;&#x4E0B;&#x6765;&#x9009;&#x4E86; Introduction to Astronomy&#xFF0C;&#x672C;&#x6765;&#x4EE5;&#x4E3A;&#x8FD9;&#x5C06;&#x4F1A;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x95E8; pass &#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x4E5F;&#x662F;&#x8FC7;&#x4E0D;&#x4E86;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x5468;&#xFF0C;&#x7B2C;&#x4E94;&#x5468;&#x7684;&#x4E60;&#x9898;&#x90FD;&#x9519;&#x8FC7;&#x4E86;&#xFF0C;&#x7B2C;&#x4E09;&#x5468;&#x7B49;&#x5230; deadline &#x524D;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x624D;&#x5F00;&#x59CB;&#x8D76;&#x8BFE;&#x4EF6;&#x505A;&#x9898;&#xFF0C;&#x7ED3;&#x679C;&#x53EA;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x534A;&#x3002;&#x65F6;&#x95F4;&#x5B89;&#x6392;&#x4E0A;&#x6709;&#x4E86;&#x5F88;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#x8BBA;&#x6536;&#x83B7;&#x786E;&#x5B9E;&#x4E0D;&#x5C11;&#xFF0C;&#x76F8;&#x4FE1;&#x80FD;&#x575A;&#x6301;&#x5168;&#x90E8;&#x770B;&#x5B8C;&#x5FC5;&#x6709;&#x88E8;&#x76CA;&#x3002;&lt;/p&gt;

&lt;p&gt;StackOverflow&#xFF0C;&#x8981;&#x8BF4;&#x4E24;&#x53E5;&#xFF0C;&#x4E00;&#x6708;&#x4EFD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F97;&#x5230;&#x6211;&#x5728; SO &#x7684;&#x7B2C;&#x4E00;&#x4E2A; bounty&#x3002;&#x7A81;&#x7136;&#x5C31;&#x6709;&#x80A1;&#x5237; SO &#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x8C08;&#x4E0D;&#x4E0A;&#x5237;&#xFF0C;&#x5C31;&#x662F;&#x79EF;&#x6781;&#x53C2;&#x4E0E;&#xFF0C;&#x4E89;&#x53D6;&#x4ECA;&#x5E74;&#x80FD;&#x5F97; 2000 &#x5206;&#x3002;&#x6211;&#x73B0;&#x5728;&#x7684;&#x91C7;&#x7EB3;&#x7387;&#x5927;&#x7EA6;&#x6709; 73%&#xFF08;&#x6837;&#x672C;&#x91CF;&#x4E0D;&#x8DB3;&#xFF09;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x7B54;&#x6848;&#x6709;&#x4E00;&#x4E2A;&#x591A; upvote &#xFF0C;&#x4FDD;&#x5B88;&#x4E00;&#x70B9;&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;&#x88AB;&#x91C7;&#x7EB3;&#x7684;&#x7B54;&#x6848;&#x90FD;&#x5F97;&#x5230;&#x4E00;&#x6B21; upvote&#xFF0C;&#x90A3;&#x4E00;&#x4E2A;&#x7B54;&#x6848;&#x7684;&#x5206;&#x503C;&#x5C31;&#x662F; 25 &#x5206;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x7684;&#x5206;&#x6570;&#x662F; 387&#x3002;&#x7B80;&#x5355;&#x7B97;&#x4E0B;&#xFF1A;&lt;script type="math/tex"&gt;1600/25/0.73=88&lt;/script&gt; &#xFF0C;&#x4E00;&#x5E74;&#x8981;&#x63D0;&#x4F9B; 88 &#x4E2A;&#x7B54;&#x6848;&#xFF0C;&#x5E73;&#x5747;&#x4E0B;&#x6765;&#x6BCF;&#x5468;&#x80FD;&#x7B54;&#x4E24;&#x9053;&#x9898;&#xFF0C;&#x5C31;&#x80FD;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x8FD9;&#x6837;&#x770B;&#x8D77;&#x6765;&#x8981;&#x6301;&#x7EED;&#x575A;&#x6301;&#x8FD8;&#x662F;&#x633A;&#x96BE;&#x7684;&#xFF0C;&#x4F55;&#x51B5;&#x4ECA;&#x5E74;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x4E00;&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x7B97;&#x4E0A;&#x519C;&#x5386;&#x5E74;&#x90A3;&#x8FD8;&#x597D;&#xFF0C;&#x6BD5;&#x7ADF;&#x4ECA;&#x5E74;&#x8FD8;&#x6709;&#x4E2A;&#x95F0;&#x6708;&#x3002;&#x8FD8;&#x662F;&#x964D;&#x4F4E;&#x8981;&#x6C42;&#x5427;&#xFF0C;&#x4E00;&#x5468;&#x4E00;&#x9053;&#x9898;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x8981;&#x5B66;&#x4F1A;&#x575A;&#x6301;&#xFF0C;&#x5176;&#x5B9E;&#x4ECA;&#x5E74;&#x80FD;&#x8FDB;&#x5165;&#x56DB;&#x4F4D;&#x6570;&#x4E5F;&#x5F88;&#x6EE1;&#x8DB3;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E00;&#x4E0B;&#x5B50;&#x6316;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x5751;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x53BB;&#x5E74;&#x5C31;&#x60F3;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x60F3;&#x4E0D;&#x5230;&#x4E00;&#x5E74;&#x8FC7;&#x540E;&#x4ECA;&#x5E74;&#x53C8;&#x8981;&#x518D;&#x558A;&#x4E00;&#x904D;&#xFF08;&#x8FD8;&#x6709;&#x4E0D;&#x5C11;&#x4ECA;&#x5E74;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x518D;&#x558A;&#x4E86;&#xFF09;&#x3002;&#x771F;&#x4E0D;&#x77E5;&#x4E00;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x600E;&#x4E48;&#x88AB;&#x6325;&#x970D;&#x7684;&#x3002;&#x5982;&#x679C;&#x5FC3;&#x6001;&#x4E0D;&#x80FD;&#x6709;&#x6240;&#x8C03;&#x6574;&#xFF0C;&#x4F30;&#x8BA1;&#x660E;&#x5E74;&#x53C8;&#x8981;&#x518D;&#x558A;&#x4E00;&#x6B21;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8FD9;&#x5C31;&#x662F;&#x53BB;&#x5E74;&#x4EA4;&#x51FA;&#x6765;&#x7684;&#x7B54;&#x5377;&#xFF1F;&#x597D;&#x9EEF;&#x6DE1;&#x7684;&#x4EBA;&#x751F;&#xFF01;&#x771F;&#x662F;&#x592A;&#x968F;&#x610F;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x4ECA;&#x5E74;&#x80FD;&#x6709;&#x6240;&#x957F;&#x8FDB;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x4EFB;&#x7684;&#x6316;&#x5751;&#x4EBA;&#x2014;&#x2014;&#x6709;&#x5751;&#x5FC5;&#x586B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x90A3;&#x4E9B;&#x4E0D;&#x4F1A;&#x5199;&#x51FA;&#x6765;&#x7684;&#x76EE;&#x6807;&#x3002;&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x7B14;&#x8BB0;&#x4E4B;&#x821B;&#xB7;&#x7834;</title>
      <link>https://douo.github.io/moon-2013//2013/10/22/the-pain-of-note-2</link>
      <pubDate>2013-10-22</pubDate>
      <description>&lt;p&gt;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8FD8;&#x6709;&lt;a href="/2013/08/16/the-pain-of-note" title=""&gt;&#x4E0A;&#x4E00;&#x7BC7;&lt;/a&gt;&#xFF0C;&#x6587;&#x7AE0;&#x5199;&#x5F97;&#x592A;&#x957F;&#x770B;&#x8D77;&#x6765;&#x592A;&#x7D2F;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x5206;&#x4E3A;&#x4E8C;&#x8F83;&#x597D;&#x3002;&#x8FD9;&#x7BC7;&#x5C31;&#x76F4;&#x63A5;&#x8BF4;&#x8BF4;&#x7528; ruhoh &#x6765;&#x642D;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x7B14;&#x8BB0;&#x7CFB;&#x7EDF;&#xFF08;&#x540C;&#x6587;&#x4E2D; notes&#xFF09;&#x7684;&#x4E0D;&#x8DB3;&#x548C;&#x4E00;&#x4E9B;&#x89E3;&#x51B3;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x53BB;&#x5E74;&#x8FD8;&#x5728;&lt;a href="/2012/08/20/something-about-ruhoh" title=""&gt;&#x8FD9;&#x91CC;&lt;/a&gt;&#x5927;&#x8C08;&#x9759;&#x6001;&#x751F;&#x6210;&#x9875;&#x9762;&#x7684;&#x79CD;&#x79CD;&#x597D;&#x5904;&#xFF0C;&#x5982;&#x4ECA;&#x60F3;&#x6765;&#x672A;&#x514D;&#x592A;&#x8FC7;&#x7406;&#x60F3;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_0"&gt;&#x4F18;&#x96C5;&#x7684;&#x547D;&#x4EE4;&#x884C;&lt;/h3&gt;
&lt;p&gt;Ruhoh &#x63D0;&#x4F9B;&#x4E86;&#x5B8C;&#x5584;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x63A5;&#x53E3;&#xFF0C;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E2D;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x64CD;&#x4F5C;&#x6587;&#x6863;&#x662F;&#x5728; Terminal&#xFF0C;&#x7F16;&#x8F91;&#x6587;&#x6863;&#x662F;&#x5728; Emacs&#xFF0C;&#x9884;&#x89C8;&#x6587;&#x6863;&#x662F;&#x5728; Chrome&#xFF0C;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x5207;&#x6362;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x60B2;&#x50AC;&#x7684;&#x662F;&#x8FD9;&#x4E09;&#x4E2A;&#x8F6F;&#x4EF6;&#x90FD;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x822C;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x7279;&#x522B;&#x662F; Chrome &#x5F88;&#x5BB9;&#x6613;&#x8D70;&#x795E;&#x3002;&#x4E00;&#x65E6;&#x5207;&#x6362;&#x540E;&#x8D70;&#x795E;&#xFF0C;&#x5C31;&#x4F1A;&#x8D70;&#x5F97;&#x5F88;&#x8FDC;&#xFF0C;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x90FD;&#x56DE;&#x4E0D;&#x6765;&#x3002;&#x8FD9;&#x6837;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x6210;&#x672C;&#xFF0C;&#x8981;&#x4FDD;&#x6301;&#x4E13;&#x6CE8;&#x5C31;&#x5F97;&#x5C3D;&#x91CF;&#x628A;&#x65F6;&#x95F4;&#x63A7;&#x5236;&#x5728;&#x7F16;&#x8F91;&#x5668;&#x5185;(&#x5168;&#x547D;&#x4EE4;&#x884C;&#x81EA;&#x7136;&#x66F4;&#x5C11;&#x5E72;&#x6270;&#xFF0C;&#x4E0D;&#x8FC7;&#x5168;&#x547D;&#x4EE4;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x7406;&#x60F3;&#x65E9;&#x5DF2;&#x79BB;&#x6211;&#x8FDC;&#x53BB;&#x4E86;)&#x3002;&#x9996;&#x5148;&#x8981;&#x7B80;&#x5316;&#x64CD;&#x4F5C;&#x6587;&#x6863;&#x7684;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x4E2A;&#x4EBA;&#x4F7F;&#x7528; &lt;code&gt;ruhoh&lt;/code&gt; &#x8FD9;&#x4E2A;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x5C31;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#xFF0C;&#x4E4B;&#x524D;&#x5C31;&#x505A;&#x4E2A;&#x4E00;&#x6B21;&lt;a href="https://gist.github.com/douo/4452974" title=""&gt;&#x7B80;&#x5316;&lt;/a&gt;&#xFF0C;&#x4F46;&#x662F; notes &#x65B9;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x547D;&#x4EE4;&#x8FD8;&#x662F;&#x5F88;&#x4E0D;&#x65B9;&#x4FBF;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x4FEE;&#x6539;&#x3002;&#x81F3;&#x4E8E;&#x9884;&#x89C8;&#x5207;&#x6362;&#x65B9;&#x9762;&#xFF0C;&#x5F97;&#x76CA;&#x4E8E; Markdown &#x7684;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x66F4;&#x591A;&#x95EE;&#x9898;&#x50CF;&#x662F;&#x5F3A;&#x8FEB;&#x75C7;&#xFF0C;&#x4E00;&#x70B9;&#x70B9;&#x6539;&#x52A8;&#x5C31;&#x8981;&#x5207;&#x6362;&#x53BB;&#x770B;&#x6548;&#x679C;&#x4E86;&#xFF0C;&#x5FC5;&#x987B;&#x6697;&#x793A;&#x81EA;&#x5DF1;&#x53EA;&#x6709;&#x683C;&#x5F0F;&#x65B9;&#x9762;&#x7684;&#x4FEE;&#x6539;&#x624D;&#x9700;&#x8981;&#x53BB;&#x770B;&#x9884;&#x89C8;&#x3002;&#x628A;&#x547D;&#x4EE4;&#x884C;&#x63A5;&#x53E3;&#x6574;&#x5408;&#x8FDB; Emacs &#x786E;&#x5B9E;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8FD9;&#x4E48;&#x7F8E;&#x597D;&#x7684;&#x613F;&#x666F;&#xFF0C;&#x5F53;&#x524D;&#x8FD8;&#x662F;&#x60F3;&#x60F3;&#x5C31;&#x597D;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_1"&gt;Git &#x6709;&#x65F6;&#x4E5F;&#x662F;&#x7D2F;&#x8D58;&lt;/h3&gt;
&lt;p&gt;git &#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6D41;&#x884C;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;&#xFF0C;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x9002;&#x7528;&#x5E7F;&#x6CDB;&#x3002;&#x4F46;&#x6709;&#x65F6;&#x592A;&#x5F3A;&#x5927;&#x4E5F;&#x4E0D;&#x662F;&#x597D;&#x4E8B;&#xFF0C;notes &#x6700;&#x9700;&#x8981;&#x7684;&#x8FD8;&#x662F;&#x540C;&#x6B65;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4; git &#x53EA;&#x662F;&#x7528;&#x6765;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x4ED3;&#x5E93;&#xFF0C;&#x7248;&#x672C;&#x63A7;&#x5236;&#x53CD;&#x800C;&#x4E0D;&#x662F;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x505A;&#x4E00;&#x6B21;&#x540C;&#x6B65;&#x592A;&#x8FC7;&#x7E41;&#x7410;&#xFF08;add&#x3001;commit&#x3001;push&#xFF09;&#xFF0C;&#x6BCF;&#x6B21;&#x8FD8;&#x90FD;&#x5FC5;&#x987B;&#x5199;&#x4E0A; comment&#xFF0C;&#x800C;&#x4E14;&#x63D0;&#x4EA4;&#x5230;&#x670D;&#x52A1;&#x5668;&#x540E;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x7F16;&#x8BD1;&#x53D1;&#x5E03;&#xFF0C;&#x4E00;&#x6B21;&#x540C;&#x6B65;&#x8981;&#x82B1;&#x8D39;&#x51E0;&#x5341;&#x79D2;&#x5341;&#x5206;&#x607C;&#x4EBA;&#x3002;&lt;/p&gt;
&lt;pre&gt;&lt;code class=""&gt;# time git push
0.02s user 0.02s system 0% cpu 21.367 total
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x540C;&#x6837;&#x8981;&#x7B80;&#x5316;&#x540C;&#x6B65;&#x547D;&#x4EE4;&#xFF0C;&#x8003;&#x8651;&#x4E3A;&#x6BCF;&#x4E2A; resource &#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x4E00;&#x6B21;&#x5B8C;&#x6210;&#x540C;&#x6B65;&#x7684;&#x6307;&#x4EE4;&#xFF08;&#x6211;&#x627F;&#x8BA4;&#x81EA;&#x52A8; comment &#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x4F46;&#x662F; comment &#x672C;&#x8EAB;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x5BF9;&#x4E8E; notes &#x4E5F;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF09;&#x4E00;&#x6B65;&#x5230;&#x4F4D;&#xFF0C;&#x629B;&#x5F03;&#x91CD;&#x590D;&#x7E41;&#x7410;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5BF9;&#x4E8E;&#x540C;&#x6B65;&#x901F;&#x5EA6;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7269;&#x7406;&#x7F51;&#x901F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65E0;&#x89E3;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x6BCF;&#x6B21;&#x540C;&#x6B65;&#x540E;&#x8FD8;&#x8981;&#x7F16;&#x8BD1;&#x53D1;&#x5E03;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5206;&#x79BB;&#x540C;&#x6B65;&#x548C;&#x53D1;&#x5E03;&#xFF0C;&#x540C;&#x6B65;&#x7684;&#x65F6;&#x5019;&#x63A8;&#x9001;&#x5230;&#x540C;&#x6B65;&#x5206;&#x652F;&#xFF0C;&#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x63A8;&#x9001;&#x5230; master &#x5206;&#x652F;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F18;&#x5316;&#x4E0B; git hook &#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#xFF0C;&#x53EA;&#x662F;&#x53C8;&#x589E;&#x52A0;&#x4E86;&#x903B;&#x8F91;&#x590D;&#x6742;&#x5EA6;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_2"&gt;&#x641C;&#x7D22;&lt;/h3&gt;
&lt;p&gt;notes &#x6700;&#x9057;&#x61BE;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x641C;&#x7D22;&#x7684;&#x7F3A;&#x5931;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x4E4B;&#x4E00;&#x3002;&#x60F3;&#x60F3;&#x770B;&#x4E00;&#x4E2A;&#x6240;&#x8C13;&#x77E5;&#x8BC6;&#x4ED3;&#x5E93;&#x6CA1;&#x4E86;&#x68C0;&#x7D22;&#x529F;&#x80FD;&#xFF0C;&#x5C31;&#x7B49;&#x4E8E;&#x662F;&#x9A6C;&#x513F;&#x6CA1;&#x4E86;&#x817F;&#xFF0C;&#x4E0D;&#x8981;&#x8BF4;&#x8DD1;&#x5F97;&#x5FEB;&#x4E86;&#x5C31;&#x8FDE;&#x8DD1;&#x4E5F;&#x8DD1;&#x4E0D;&#x8D77;&#x6765;&#xFF0C;&#x53EA;&#x80FD;&#x6CA6;&#x4E3A;&#x6446;&#x8BBE;&#x4E86;&#x3002;&#x9759;&#x6001;&#x751F;&#x6210;&#x7684;&#x7F51;&#x7AD9;&#x5728;&#x641C;&#x7D22;&#x65B9;&#x9762;&#x786E;&#x5B9E;&#x662F;&#x786C;&#x4F24;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x529E;&#x6CD5;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x8C37;&#x6B4C;&#x7684;&#x5B9A;&#x5236;&#x641C;&#x7D22;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x4E00;&#x822C;&#x7684;&#x535A;&#x5BA2;&#x8FD8;&#x662F;&#x8DB3;&#x591F;&#x7684;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4E2A;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#x51E0;&#x4E4E;&#x65E0;&#x4EBA;&#x8BBF;&#x95EE;&#x7684; notes &#x6765;&#x8BF4;&#xFF0C;&#x8C37;&#x6B4C;&#x7684;&#x6536;&#x5F55;&#x80FD;&#x505A;&#x5230;&#x591A;&#x53CA;&#x65F6;&#x80FD;&#x505A;&#x5230;&#x591A;&#x5168;&#x9762;&#x5462;&#xFF1F;&#x786E;&#x5B9E;&#x662F;&#x4E2A;&#x7591;&#x95EE;&#x3002;&lt;/p&gt;
&lt;h4 id="toc_3"&gt;Swiftype&lt;/h4&gt;
&lt;p&gt;&#x8C37;&#x6B4C;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x522B;&#x7684;&#x641C;&#x7D22;&#x516C;&#x53F8;&#xFF08;&#x67D0;&#x767E;&#xFF1A;&#x662F;&#x6211;&#x5417;&#xFF1F;&#x662F;&#x8BF4;&#x6211;&#x5417;&#xFF1F;&#xFF09;&#xFF0C; &lt;a href="https://swiftype.com/" title=""&gt;swiftype&lt;/a&gt;&#xFF0C; &#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x505A;&#x7AD9;&#x5185;&#x641C;&#x7D22;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x514D;&#x8D39;&#x8D26;&#x53F7;&#x6BCF;&#x5468;&#x4E00;&#x6293;&#xFF0C;&#x5BF9;&#x4E8E;&#x535A;&#x5BA2;&#x6765;&#x8BF4;&#x8FD8;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#xFF0C;&#x5BF9;&#x4E8E;&#x7B14;&#x8BB0;&#x6765;&#x8BF4;&#x6709;&#x70B9;&#x6EDE;&#x540E;&#x4E86;&#xFF0C;&#x6700;&#x591A; 1000 &#x4EFD;&#x6587;&#x6863;&#xFF0C;&#x4F3C;&#x4E4E;&#x4E5F;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x96BE;&#x7A81;&#x7834;&#x3002;&#x4E2D;&#x6587;&#x652F;&#x6301;&#x4E5F;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x5F85;&#x9A8C;&#x8BC1;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5F88;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F; swiftype &#x7684; API&#x3002;swiftype &#x53EF;&#x4EE5;&#x5206; documentType &#x81EA;&#x5DF1;&#x8BBE;&#x8BA1; schema&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x9177;&#x3002;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x63D0;&#x4EA4;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x7528;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x5B9A;&#x65F6;&#x6293;&#x53D6;&#x4E86;&#x5417;? &#x4ECD;&#x7136;&#x6709;&#x5F85;&#x6DF1;&#x7A76;&#x3002;&lt;/p&gt;
&lt;h4 id="toc_4"&gt;Evernote&lt;/h4&gt;
&lt;p&gt;Evernote &#x600E;&#x4E48;&#x4E71;&#x5165;&#x4E86;&#xFF1F;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x901A;&#x8FC7; &lt;a href="http://dev.evernote.com/doc/start/ruby.php" title=""&gt;Evernote  API&lt;/a&gt;&#xFF0C;&#x6BCF;&#x6B21;&#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x540C;&#x6B65;&#x8F93;&#x51FA;&#x5230; Evernote &#xFF0C; &#x5728; Evernote &#x4E2D;&#x505A;&#x641C;&#x7D22;&#x3002;&#x5982;&#x679C;&#x771F;&#x7684;&#x53EF;&#x884C;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E5F;&#x4E0D;&#x5931;&#x4E3A;&#x4E00;&#x4E2A;&#x597D;&#x529E;&#x6CD5;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_5"&gt;&#x7ED3;&#x6784;&lt;/h3&gt;
&lt;p&gt;&#x641C;&#x7D22;&#x65B9;&#x9762;&#x7684;&#x9057;&#x61BE;&#xFF0C;&#x901A;&#x8FC7;&#x7ED3;&#x6784;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x5F25;&#x8865;&#x5C11;&#x8BB8;&#x56DE;&#x6765;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x7ED3;&#x6784;&#x4E0D;&#x4F46;&#x770B;&#x8D77;&#x6765;&#x8D4F;&#x5FC3;&#x60A6;&#x76EE;&#xFF0C;&#x5BF9;&#x68C0;&#x7D22;&#x4E5F;&#x8D77;&#x5230;&#x5F88;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;notes &#x4E2D;&#x7684;&#x7ED3;&#x6784;&#x5B9E;&#x9645;&#x5C31;&#x662F;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x3002;&#x7EC4;&#x7EC7;&#x4FE1;&#x606F;&#x662F;&#x4E00;&#x95E8;&#x5F88;&#x9AD8;&#x6DF1;&#x7684;&#x5B66;&#x95EE;&#x3002;&#x5206;&#x7C7B;&#x5B66;&#x672C;&#x8EAB;&#x5C31;&lt;a href="http://en.wikipedia.org/wiki/Taxonomy_(general)" title=""&gt;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x79D1;&lt;/a&gt;&#xFF0C;&#x505A;&#x597D;&#x5206;&#x7C7B;&#x662F;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x5B50;&#x7C7B;&#x662F;&#x4E92;&#x65A5;&#x7684;&#xFF0C;&#x5F53;&#x6211;&#x521B;&#x5EFA;&#x7B14;&#x8BB0;&#x7684;&#x65F6;&#x5019;&#x5206;&#x7C7B;&#x4F5C;&#x4E3A;&#x5FC5;&#x586B;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x8981;&#x600E;&#x4E48;&#x5206;&#x7C7B;&#x624D;&#x80FD;&#x964D;&#x4F4E;&#x4E3A;&#x65B0;&#x7B14;&#x8BB0;&#x5B9A;&#x4F4D;&#x5206;&#x7C7B;&#x7684;&#x96BE;&#x5EA6;&#x3002;&#x4E3A;&#x4E86;&#x964D;&#x4F4E;&#x9009;&#x62E9;&#x56F0;&#x96BE;&#x75C7;&#x7684;&#x56F0;&#x6270;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x628A;&#x5206;&#x7C7B;&#x5355;&#x72EC;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x5BF9;&#x4E8E;&#x7B14;&#x8BB0;&#x6765;&#x8BF4;&#x5206;&#x7C7B;&#x53EA;&#x80FD;&#x4ECE;&#x4E00;&#x4EFD;&#x53D7;&#x63A7;&#x8BCD;&#x8868;&#x9009;&#x62E9;&#x3002;&#x8FD9;&#x4E2A;&#x5206;&#x7C7B;&#x8868;&#x6211;&#x53E6;&#x5916;&#x7EF4;&#x62A4;&#xFF0C;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x5174;&#x8DA3;&#x548C;&#x4E13;&#x4E1A;&#x5148;&#x8BBE;&#x8BA1;&#x597D;&#x5206;&#x7C7B;&#xFF0C;&lt;a href="/assets/media/categories.org" title=""&gt;categories.org&lt;/a&gt; &#x662F;&#x8FD9;&#x4EFD;&#x975E;&#x5E38;&#x521D;&#x671F;&#x7684;&#x5206;&#x7C7B;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x65E6;&#x6709;&#x4FEE;&#x6539;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x4FEE;&#x6539;&#x8FD9;&#x4EFD;&#x8868;&#xFF0C;&#x7B14;&#x8BB0;&#x91CC;&#x624D;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_6"&gt;&#x66F4;&#x4E30;&#x5BCC;&#x7684;&#x5143;&#x6570;&#x636E;&lt;/h3&gt;
&lt;p&gt;&#x5B9E;&#x9645;&#x4E0A;&#x53BB;&#x6389;&#x5206;&#x7C7B;&#x3001;&#x6807;&#x9898;&#x548C;&#x4E00;&#x4E9B;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x5143;&#x6570;&#x636E;&#x8FD9;&#x91CC;&#x7684;&#x5143;&#x6570;&#x636E;&#x5C31;&#x662F;&#x4E13;&#x6307;&#x6807;&#x7B7E;&#xFF0C;&#x4F5C;&#x4E3A;&#x624B;&#x52A8;&#x751F;&#x6210;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD8;&#x8981;&#x662F;&#x9075;&#x5FAA;&#x591F;&#x7528;&#x5C31;&#x597D;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x51CF;&#x5C11;&#x4EBA;&#x529B;&#x6295;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x4E86;&#x51E0;&#x4E2A;&#x8FD8;&#x662F;&#x53EA;&#x6709;&#x6807;&#x7B7E;&#x662F;&#x5FC5;&#x987B;&#x3002;&#x6807;&#x7B7E;&#x5BF9;&#x4E8E;&#x68C0;&#x7D22;&#x548C;&#x5F52;&#x7EB3;&#x90FD;&#x8D77;&#x5230;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x8981;&#x3002; ruhoh &#x652F;&#x6301;&#x6807;&#x7B7E;&#xFF0C;&#x4F46;&#x4EC5;&#x4EC5;&#x662F;&#x7EAF;&#x624B;&#x5199;&#x7684;&#x6807;&#x7B7E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8F85;&#x52A9;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x6211;&#x4EEC;&#x6253;&#x6807;&#x7B7E;&#x7684;&#x65F6;&#x5019;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x5DF2;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4E0D;&#x7136;&#x5F88;&#x5BB9;&#x6613;&#x6253;&#x4E0A;&#x540C;&#x4E49;&#x8BCD;&#x6216;&#x8005;&#x6587;&#x672C;&#x4E0A;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#x610F;&#x4E49;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x52A0;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x5EFA;&#x8BAE;&#x529F;&#x80FD;&#x3002;&#x9700;&#x8981;&#x76D1;&#x542C;&#x76EE;&#x5F55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B9E;&#x65F6;&#x66F4;&#x65B0;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x5217;&#x8868;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x5012;&#x5BB9;&#x6613;&#xFF0C;&#x63A5;&#x5165; Emacs &#x7684;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x529F;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x9EBB;&#x70E6;&#x4E00;&#x70B9;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_7"&gt;&#x4E0D;&#x8981;&#x7528;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x6765;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x95EE;&#x9898;&lt;/h3&gt;
&lt;p&gt;notes &#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5199;&#x4F5C;&#x548C;&#x5F52;&#x6863;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x8FD9;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x3002;&#x8BB0;&#x7B14;&#x8BB0;&#xFF0C;&#x8BF4;&#x662F;&#x4E00;&#x4EF6;&#x4E8B;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x591A;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#xFF0C;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#xFF0C;&#x8BB0;&#x5FC6;&#xFF0C;&#x8F85;&#x52A9;&#x5B66;&#x4E60;&#x3002;&#x4F01;&#x56FE;&#x7528; notes &#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x672A;&#x514D;&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x6211;&#x675F;&#x7F1A;&#x3002;&#x5404;&#x4E2A;&#x7EC6;&#x5206;&#x7684;&#x9886;&#x57DF;&#x8FD8;&#x6709;&#x5404;&#x79CD;&#x4E13;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x53D1;&#x6325;&#x7740;&#x5F3A;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x3002;&lt;/p&gt;
&lt;h4 id="toc_8"&gt;Evernote&lt;/h4&gt;
&lt;p&gt;Evernote &#x786E;&#x5B9E;&#x6709;&#x628A;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x90FD;&#x5305;&#x63FD;&#x7ED9;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x91CE;&#x5FC3;&#xFF0C;&#x4F5C;&#x4E3A;&#x672A;&#x6765;&#x4EBA;&#x7C7B;&#x5927;&#x8111;&#x5916;&#x90E8;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x79CD;&#x5B50;&#x9009;&#x624B;&#xFF0C;&#x7B49;&#x5230;&#x6709;&#x4E00;&#x5929;&#x53EF;&#x4EE5;&#x65E0;&#x7F1D;&#x5BF9;&#x63A5;&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x65E0;&#x654C;&#x4E86;&#xFF0C;&#x53EF;&#x60DC;&#x7406;&#x60F3;&#x5F88;&#x4E30;&#x6EE1;&#xFF0C;&#x73B0;&#x5B9E;&#x5F88;&#x9AA8;&#x611F;&#xFF0C;&#x90A3;&#x4E00;&#x5929;&#x8FD8;&#x8FDC;&#x8FDC;&#x770B;&#x4E0D;&#x5230;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E0D;&#x8FC7;&#xFF0C;Evernote &#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x70B9;&#x7684;&#xFF0C;&#x5168;&#x5E73;&#x53F0;&#x652F;&#x6301;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x5143;&#x6570;&#x636E;&#x7BA1;&#x7406;&#xFF0C;&#x5185;&#x6587;&#x641C;&#x7D22;&#xFF0C;&#x5404;&#x79CD;&#x4FBF;&#x5229;&#x7684;&#x5DE5;&#x5177;&#xFF08;&#x9644;&#x4EF6;&#xFF0C;&#x62CD;&#x7167;&#xFF0C;&#x526A;&#x5207;&#xFF0C;&#x6536;&#x85CF;&#xFF0C;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x6587;&#x672C;&#x6BB5;&#x52A0;&#x5BC6;&#xFF0C;&#x5F00;&#x653E; API&#x3002;&#x770B;&#x8D77;&#x6765;&#x8BA9;&#x4EBA;&#x5F88;&#x5FC3;&#x52A8;&#x5427;&#x3002;&#x53EF;&#x60DC;&#x4E24;&#x4E2A;&#x7F3A;&#x70B9;&#x8BA9;&#x6211;&#x8981;&#x9010;&#x6B65;&#x6446;&#x8131;&#x5BF9;&#x5176;&#x7684;&#x4F7F;&#x7528;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6240;&#x89C1;&#x5373;&#x6240;&#x5F97;&#x7684;&#x7F16;&#x8F91;&#x6A21;&#x5F0F;&#xFF0C;&#x8BA9;&#x4EBA;&#x5728;&#x5199;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&lt;strong&gt;&#x6837;&#x5F0F;&lt;/strong&gt;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x6837;&#x8BF4;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x65E0;&#x6240;&#x8C13;&#x5C0F;&#x95EE;&#x9898;&#x800C;&#x5DF2;&#xFF0C;&#x4F46;&#x5F53;&#x4E3A;&#x4E00;&#x4E2A;&#x770B;&#x4E0D;&#x5230;&#x7684;&#x672A;&#x5173;&#x95ED;&#x7684;&#x6807;&#x7B7E;&#x5BFC;&#x81F4;&#x683C;&#x5F0F;&#x5931;&#x63A7;&#x800C;&#x6293;&#x72C2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5230;&#x5E95;&#x6709;&#x591A;&#x5C0F;&#x3002;&#x53E6;&#x5916;&#x6709; Emacs &#x8FD9;&#x6837;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x4E3A;&#x4F55;&#x8FD8;&#x8981;&#x7528; evernote &#x90A3;&#x76F8;&#x5BF9;&#x7E41;&#x7410;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5462;&#x3002;&lt;/p&gt;

&lt;p&gt;Evernote &#x786E;&#x5B9E;&#x5F88;&#x5408;&#x9002;&#x6765;&#x505A;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#xFF0C;&#x4F46;&#x662F; notes &#x8FD9;&#x65B9;&#x9762;&#x5E76;&#x4E0D;&#x5DEE;&#xFF0C;&#x7455;&#x4E0D;&#x63A9;&#x745C;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x6743;&#x8861;&#x4E4B;&#x4E0B;&#x6211;&#x751A;&#x81F3;&#x89C9;&#x5F97; notes &#x7684;&#x5F97;&#x5206;&#x66F4;&#x9AD8;&#x4E9B;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5FEB;&#x901F;&#x8BB0;&#x5F55;&#xFF0C;&#x662F; notes &#x7684;&#x77ED;&#x677F;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x76F4;&#x63A5;&#x51FA;&#x5C40;&#x3002;&#x800C; Evernote &#x6709;&#x4E86;&#x5404;&#x79CD;&#x4FBF;&#x5229;&#x5DE5;&#x5177;&#x7684;&#x8F85;&#x52A9;&#xFF0C;&#x5FEB;&#x901F;&#x8BB0;&#x5F55;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x8BF4;&#x505A;&#x7684;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8F6F;&#x4EF6;&#x5E9E;&#x5927;&#xFF0C;&#x542F;&#x52A8;&#x7F13;&#x6162;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x79FB;&#x52A8; App &#x4E5F;&#x662F;&#x90A3;&#x4E48;&#x5E9E;&#x5927;&#xFF0C;&#x62FF;&#x6765;&#x505A;&#x4FBF;&#x7B7E;&#x6216;&#x8005;&#x5FEB;&#x901F;&#x8BB0;&#x5F55;&#x5C31;&#x663E;&#x5730;&#x81C3;&#x80BF;&#x4E86;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x6709;&#x4E2A;&#x4E13;&#x5BB6;&#xFF0C;&#x5C31;&#x662F; Google Keep&#x3002;&lt;/p&gt;
&lt;h4 id="toc_9"&gt;Keep&lt;/h4&gt;
&lt;p&gt;Keep &#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x975E;&#x5E38;&#x7B80;&#x7EA6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728; Android &#x5E73;&#x53F0;&#xFF0C;&#x4F5C;&#x4E3A;&#x8C37;&#x6B4C;&#x4EB2;&#x513F;&#x5B50;&#xFF0C;&#x4E0D;&#x7528;&#x4ED6;&#x90FD;&#x89C9;&#x5F97;&#x4E8F;&#x3002;&#x5176;&#x4ED6;&#x5E73;&#x53F0;&#x76EE;&#x524D;&#x8C8C;&#x4F3C;&#x53EA;&#x6709; web app &#x6216;&#x7B2C;&#x4E09;&#x65B9;&#x53EF;&#x7528;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4F46;&#x662F;&#x6709;&#x4E24;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97; Keep &#x53EA;&#x9002;&#x5408;&#x505A;&#x4E34;&#x65F6;&#x5FEB;&#x901F;&#x8BB0;&#x5F55;&#x7684;&#x5DE5;&#x5177;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5176;&#x4E00;&#xFF0C;&#x4F5C;&#x4E3A;&#x8BB0;&#x5F55;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x7684; App &#x7ADF;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x52A0;&#x9501;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x4E3A;&#x5C01;&#x5B58;&#x7684;&#x6587;&#x6863;&#x52A0;&#x4E2A;&#x8BBF;&#x95EE;&#x5BC6;&#x7801;&#x5427;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5176;&#x4E8C;&#xFF0C;&#x7ECF;&#x5386;&#x8FC7; Reader &#x5173;&#x95ED;&#x4E8B;&#x4EF6;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x90FD;&#x77E5;&#x9053;&#x8C37;&#x6B4C;&#x7684;&#x670D;&#x52A1;&#x6709;&#x591A;&#x5371;&#x9669;&#x5427;&#xFF0C;&#x4F5C;&#x4E3A;&#x968F;&#x65F6;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x8C37;&#x6B4C;&#x4F17;&#x591A;&#x5173;&#x95ED;&#x670D;&#x52A1;&#x7684;&#x4E00;&#x5458;&#xFF0C;&#x6211;&#x7ADF;&#x627E;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5BFC;&#x51FA; Keep &#x7684;&#x9009;&#x9879;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5176;&#x4ED6;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8F85;&#x52A9;&#x5DE5;&#x5177;&#x7684;&#x7F3A;&#x4E4F;&#xFF0C;&#x597D;&#x6BD4;&#x7F51;&#x9875;&#x526A;&#x5207;&#x65E0;&#x80FD;&#xFF0C;&#x5C31;&#x5F53;&#x662F;&#x4E3A;&#x5FEB;&#x901F;&#x6240;&#x505A;&#x7684;&#x727A;&#x7272;&#x5427;&#x3002;&#x8FD8;&#x522B;&#x5FD8;&#x4E86;&#x65E0;&#x6240;&#x4E0D;&#x5728;&#x7684;&#x5899;&#xFF0C;&#x5076;&#x5C14;&#x8BA9;&#x4F60;&#x62BD;&#x98CE;&#x4E00;&#x6B21;&#x4F30;&#x8BA1;&#x5C31;&#x5F97;&#x54ED;&#x4E86;&#x3002;&lt;/p&gt;
&lt;h4 id="toc_10"&gt;XMind&lt;/h4&gt;
&lt;p&gt;&#x514D;&#x8D39;&#x5F00;&#x6E90;&#x7684;&#x8111;&#x56FE;&#x5DE5;&#x5177;&#xFF0C;&#x8D2B;&#x82E6;&#x5927;&#x4F17;&#x7684;&#x6700;&#x4F73;&#x9009;&#x62E9;&#x3002;&#x514D;&#x8D39;&#x7248;&#x7684;&#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x597D;&#x4E86;&#xFF0C;&#x7528; Google Drive &#x89E3;&#x51B3;&#x540C;&#x6B65;&#x95EE;&#x9898;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_11"&gt;&#x8FD8;&#x662F;&#x4E60;&#x60EF;&#x7684;&#x95EE;&#x9898;&lt;/h3&gt;
&lt;p&gt;&#x8BF4;&#x5230;&#x5E95;&#xFF0C;&#x5DE5;&#x5177;&#x6BD5;&#x7ADF;&#x662F;&#x5DE5;&#x5177;&#x3002;&#x4EBA;&#x624D;&#x662F;&#x91CD;&#x70B9;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x5DE5;&#x5177;&#x7684;&#x5F31;&#x70B9;&#xFF0C;&#x5176;&#x5B9E;&#x6700;&#x5E94;&#x8BE5;&#x53CD;&#x601D;&#x7684;&#x8FD8;&#x662F;&#x4EBA;&#x6027;&#x7684;&#x5F31;&#x70B9;&#xFF0C;&#x53C8;&#x6070;&#x6070;&#x662F;&#x6211;&#x6CA1;&#x6709;&#x53CD;&#x7701;&#x7684;&#xFF08;&#x61D2;&#x60F0;&#x3001;&#x77ED;&#x89C6;&#x3001;&#x8D2A;&#x5A6A;&#xFF0C;&#x592A;&#x591A;&#x52A3;&#x6839;&#x6027;&#x4E86;&#xFF09;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x624D;&#x80FD;&#x53D1;&#x6325;&#x5DE5;&#x5177;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x5E0C;&#x671B;&#x4EE5;&#x4E60;&#x60EF;&#x4E3A;&#x5207;&#x5165;&#x70B9;&#xFF0C;&#x603B;&#x7ED3;&#x51FA;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x6D41;&#x7A0B;&#xFF0C;&#x5E76;&#x4F9D;&#x5176;&#x6267;&#x884C;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6574;&#x7406;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x56DE;&#x987E;&#xFF0C;&#x90FD;&#x505A;&#x597D;&#x8BA1;&#x5212;&#x3002;&lt;strong&gt;&#x8BA1;&#x5212;&#x5E76;&#x575A;&#x6301;&lt;/strong&gt;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4F7F;&#x7528;&#x4E60;&#x60EF;&#x624D;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_12"&gt;&#x516C;&#x5F00;&#x8FD8;&#x662F;&#x8BA9;&#x4EBA;&#x62C5;&#x5FE7;&lt;/h3&gt;
&lt;p&gt;&#x5DEE;&#x70B9;&#x5FD8;&#x4E86;&#x63D0;&#x8FD9;&#x4E2A;&#xFF0C;&#x65E0;&#x53EF;&#x5426;&#x8BA4;&#x9690;&#x79C1;&#x662F;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x516C;&#x5F00;&#x5E76;&#x4E0D;&#x80FD;&#x8BF4;&#x660E;&#x6709;&#x591A;&#x4E48;&#x597D;&#x6216;&#x8005;&#x591A;&#x4E48;&#x5766;&#x8361;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5F53;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x65F6;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x5199;&#x5B8C;&#x5C31;&#x4F1A;&#x88AB;&#x4EBA;&#x770B;&#x5230;&#xFF0C;&#x80AF;&#x5B9A;&#x4F1A;&#x6709;&#x6240;&#x987E;&#x5FCC;&#x7684;&#x3002;&#x5373;&#x4FBF;&#x662F;&#x6709;&#x4E86;&#x987E;&#x5FCC;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x5C0F;&#x5FC3;&#x6CC4;&#x9732;&#x51FA;&#x4E00;&#x4E9B;&#x4E0D;&#x80FD;&#x516C;&#x5F00;&#x7684;&#x4FE1;&#x606F;&#x4E5F;&#x4F1A;&#x9020;&#x6210;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x56F0;&#x6270;&#x3002;&lt;/p&gt;

&lt;p&gt;ruhoh &#x73B0;&#x5728;&#x628A;&#x4F4D;&#x4E8E; resource &#x5185;&#x7684; draft &#x6587;&#x4EF6;&#x5939;&#x5185;&#x7684;&#x6587;&#x6863;&#x90FD;&#x5F53;&#x6210; draft &#x800C;&#x5FFD;&#x7565;&#x4E86; draft type&#x3002;&#x5BF9;&#x4E8E; notes &#x8FD9;&#x79CD;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x654F;&#x611F;&#x7684;&#x96C6;&#x5408;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x662F;&#x7528; draft type &#x5C5E;&#x6027;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x3002;&#x800C;&#x9ED8;&#x8BA4;&#x7B14;&#x8BB0;&#x90FD;&#x662F;&#x4E0D;&#x516C;&#x5E03;&#x7684;&#xFF0C;&#x79FB;&#x9664;&#x6389; draft &#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x624D;&#x53EF;&#x4EE5;&#x53D1;&#x5E03;&#x51FA;&#x6765;&#x3002;&lt;/p&gt;
</description>
    </item>
    <item>
      <title>staticfile.org</title>
      <link>https://douo.github.io/moon-2013//2013/10/07/staticfile-org</link>
      <pubDate>2013-10-07</pubDate>
      <description>&lt;p&gt;&#x65E0;&#x5948; cdnjs &#x88AB;&#x5899;&#xFF0C;&#x53EA;&#x80FD;&#x9009;&#x7528;&lt;a href="http://bbs.aliyun.com/read.php?tid=139395&amp;ordertype=desc&amp;displayMode=1" title=""&gt;&#x56FD;&#x5185;&#x7684;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x52A0;&#x901F;&#x670D;&#x52A1;&lt;/a&gt;&#xFF0C;&#x53EF;&#x60DC;&#x90FD;&#x4E0D;&#x7406;&#x60F3;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5E78;&#x597D;&#x53D1;&#x73B0;&#x4E86; &lt;a href="http://www.staticfile.org/" title=""&gt;staticfile.org&lt;/a&gt;&#xFF0C;&#x4ED6;&#x5F15;&#x7528;&#x4E86; cdnjs &#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x56FD;&#x5185;&#x4ED3;&#x5E93;&#xFF0C;&#x5E93;&#x5EA6;&#x6570;&#x91CF;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x7528;&#x4E86;&#x4E03;&#x725B;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x901F;&#x5EA6;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8003;&#x8651;&#x5199;&#x4E2A; Ruby &#x7684;&#x5DE5;&#x5177;&#x65B9;&#x4FBF; ruhoh &#x4F7F;&#x7528;&#x3002;&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x7B14;&#x8BB0;&#x4E4B;&#x821B;&#xB7;&#x5E8F;</title>
      <link>https://douo.github.io/moon-2013//2013/08/16/the-pain-of-note</link>
      <pubDate>2013-08-16</pubDate>
      <description>&lt;p&gt;&lt;link type="text/css" rel="stylesheet" href="//cdn.jsdelivr.net/jqplot/1.0.8/jquery.jqplot.min.css" /&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/jquery.jqplot.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.barRenderer.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.blockRenderer.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.canvasAxisTickRenderer.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.canvasTextRenderer.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.categoryAxisRenderer.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.dateAxisRenderer.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.highlighter.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.json2.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdn.jsdelivr.net/jqplot/1.0.8/plugins/jqplot.pointLabels.min.js"&gt;&lt;/script&gt;&lt;/p&gt;

&lt;script type="text/javascript" src="/assets/media/note_system_review.js"&gt;&lt;/script&gt;

&lt;style type="text/css"&gt;
    .myChart {margin:auto;}
&lt;/style&gt;

&lt;p&gt;&#x4E0B;&#x56FE;&#x662F;&#x4E00;&#x5E74;&#x5185;&#x6240;&#x5EFA;&#x7B14;&#x8BB0;&#x7684;&#x7EDF;&#x8BA1;&#x56FE;&#x3002;&lt;/p&gt;

&lt;div id="chartContainer"&gt;
&lt;div id="plotChart" class="myChart"&gt;&lt;/div&gt;
&lt;/div&gt;

&lt;p&gt;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x7684;&#x6570;&#x636E;&#x4E0E;&#x6211;&#x9884;&#x60F3;&#x4E2D;&#x7684;&#x6548;&#x679C;&#x76F8;&#x5DEE;&#x751A;&#x8FDC;&#x3002;&#x66F4;&#x8BA9;&#x4EBA;&#x5931;&#x671B;&#x7684;&#x662F;&#x5176;&#x4E2D;&#x4E34;&#x65F6;&#x521B;&#x5EFA;&#x540E;&#x6CA1;&#x6709;&#x5F52;&#x7C7B;&#x6574;&#x7406;&#x7684;&#x7B14;&#x8BB0;&#x5360;&#x4E86;&#x5C06;&#x8FD1;&#x4E00;&#x534A;&#x3002;&#x5F53;&#x7136;&#x521B;&#x5EFA;&#x7B14;&#x8BB0;&#x7684;&#x6570;&#x76EE;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x8BF4;&#x660E;&#x4EC0;&#x4E48;&#x3002;&#x82E5;&#x80FD;&#x7EDF;&#x8BA1;&#x51FA;&#x5404;&#x4E2A;&#x6587;&#x4EF6;&#x4FEE;&#x6539;&#x7684;&#x6B21;&#x6570;&#x8FD9;&#x4E2A;&#x624D;&#x66F4;&#x6709;&#x8BF4;&#x670D;&#x529B;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x6CA1;&#x89C4;&#x8303; git &#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x8981;&#x7EDF;&#x8BA1;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x81EA;&#x5DF1;&#x4F30;&#x7B97;&#x4E86;&#x4E0B;&#x611F;&#x89C9;&#x56DE;&#x5934;&#x6574;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x5B9E;&#x5728;&#x592A;&#x7A00;&#x5C11;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x63A5;&#x8FD1;&#x4E8E;&#x96F6;&#x3002;&#x4E0D;&#x5F97;&#x4E0D;&#x53CD;&#x601D;&#x5F04;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x51FA;&#x6765;&#x5230;&#x5E95;&#x662F;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_0"&gt;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7B14;&#x8BB0;&#xFF1F;&lt;/h3&gt;
&lt;p&gt;&#x4E00;&#x5F00;&#x59CB;&#x6211;&#x662F;&#x5E0C;&#x671B;&#x505A;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x4E2A;&#x4EBA;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x3001;&#x4FBF;&#x7B7E;&#x3001;&#x8F85;&#x52A9;&#x5B66;&#x4E60;&#x3001;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#xFF0C;&#x8FD9;&#x91CC;&#x6682;&#x79F0;&#x4E3A; notes&#xFF08;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x79F0;&#x547C;&#x5728;&#x8FD9;&#x6587;&#x7AE0;&#x5185;&#x624D;&#x751F;&#x6548;&#xFF0C;&#x6CA1;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x79F0;&#x547C;&#x5199;&#x8D77;&#x6765;&#x5F88;&#x62D7;&#xFF0C;&#x53EB;&#x4EC0;&#x4E48;&#x7B14;&#x8BB0;&#x7CFB;&#x7EDF;&#x7684;&#x53C8;&#x663E;&#x5F97;&#x5F88;&#x4E13;&#x4E1A;&#x4E00;&#x6837;&#xFF09;&#x3002;&#x8FD9;&#x53EA;&#x662F;&#x4E2A;&#x5927;&#x997C;&#xFF0C;&#x5927;&#x591A;&#x90FD;&#x662F;&#x505C;&#x7559;&#x5728;&#x7F8E;&#x4E3D;&#x7684;&#x60F3;&#x8C61;&#x3002;&#x771F;&#x6B63;&#x9A71;&#x52A8;&#x6211;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x9700;&#x8981;&#xFF0C;&lt;strong&gt;&#x4E0D;&#x8981;&#x91CD;&#x590D;&#x89E3;&#x51B3;&#x4EE5;&#x524D;&#x89E3;&#x51B3;&#x8FC7;&#x7684;&#x95EE;&#x9898;&lt;/strong&gt;&#x3002;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x90FD;&#x6709;&#x8FC7;&#x4F53;&#x4F1A;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x4E4B;&#x524D;&#x586B;&#x8FC7;&#x7684;&#x5751;&#xFF0C;&#x5374;&#x627E;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x4EE5;&#x5F80;&#x586B;&#x5751;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x53EA;&#x5F97;&#x91CD;&#x65B0;&#x586B;&#x4E00;&#x904D;&#xFF0C;&#x8FD9;&#x771F;&#x662F;&#x4E00;&#x79CD;&#x6298;&#x78E8;&#x3002;&#x6211;&#x7684;&#x76EE;&#x7684;&#x5176;&#x5B9E;&#x5F88;&#x5355;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x8BB0;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x586B;&#x5751;&#x7ECF;&#x9A8C;&#xFF0C;&#x907F;&#x514D;&#x4EE5;&#x540E;&#x81EA;&#x5DF1;&#x6216;&#x8005;&#x522B;&#x4EBA;&#x8E29;&#x5751;&#x3002;&#x7136;&#x540E;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x5C31;&#x5F88;&#x597D;&#x4E86;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E00;&#x4E2A;&#x7B14;&#x8BB0;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E86;&#x56DE;&#x987E;&#x3001;&#x5199;&#x597D;&#x5C31;&#x5C01;&#x5B58;&#x8D77;&#x6765;&#x6CA1;&#x4EBA;&#x770B;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x80AF;&#x5B9A;&#x4F1A;&#x5931;&#x53BB;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x8BB0;&#x5F55;&#x5230; notes &#x4E2D;&#x5E76;&#x516C;&#x5F00;&#xFF0C;&#x6700;&#x5927;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x8981;&#x51CF;&#x5C11;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x51FA;&#x73B0;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_1"&gt;&#x7B14;&#x8BB0;&#x8BB0;&#x4EC0;&#x4E48;&#xFF1F;&lt;/h3&gt;
&lt;p&gt;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5751;&#xFF0C;&#x586B;&#x8FC7;&#x540E;&#x8FD8;&#x503C;&#x5F97;&#x4E00;&#x8BB0;&#x5462;&#xFF1F;&lt;/p&gt;

&lt;blockquote&gt;
&lt;p&gt;Where is the windom we have lost in knowledge.&lt;/p&gt;

&lt;p&gt;Where is the knowledge we have lost in information.&lt;/p&gt;

&lt;p&gt;T. S. Eliot: The Rock&lt;/p&gt;
&lt;/blockquote&gt;

&lt;p&gt;&#x6211;&#x89C9;&#x5F97;&#x7B14;&#x8BB0;&#x7684;&#x5185;&#x5BB9;&#x6070;&#x597D;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x4E09;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x601D;&#x60F3;&#xFF0C;&#x77E5;&#x8BC6;&#xFF0C;&#x4FE1;&#x606F;&#x3002;&#x601D;&#x60F3;&#x6BD4;&#x77E5;&#x8BC6;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x77E5;&#x8BC6;&#x6BD4;&#x4FE1;&#x606F;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#x3002;&#x8FD9;&#x4E09;&#x4E2A;&#x6982;&#x5FF5;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#xFF0C;&#x5C42;&#x6B21;&#x5982;&#x4F55;&#x754C;&#x5B9A;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FD8;&#x5F88;&#x56F0;&#x96BE;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x9996;&#x5148;&#x5E94;&#x8BE5;&#x662F;&#x76F8;&#x5BF9;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x83B7;&#x53D6;&#x7684;&#x96BE;&#x5EA6;&#x6765;&#x5212;&#x5206;&#x3002;&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5929;&#x7A7A;&#x662F;&#x84DD;&#x8272;&#x7684;&#x3002;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7528;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x83B7;&#x53D6;&#x5230;&#xFF0C;&#x6BD4;&#x5982; objc &#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#x6216;&#x8005;&#x5982;&#x4F55;&#x5B9E;&#x4F8B;&#x5316;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF08;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x6709;&#x4E2A;&#x524D;&#x63D0;&#x662F;&#x6211;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x65E0;&#x6CD5;&#x51C6;&#x786E;&#x5730;&#x7528; objc &#x8BED;&#x6CD5;&#x5199;&#x51FA;&#x6765;&#x3002;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x5F53;&#x6210;&#x4FE1;&#x606F;&#xFF0C;&#x5F88;&#x591A;&#x90FD;&#x662F;&#x4E0D;&#x503C;&#x5F97;&#x82B1;&#x65F6;&#x95F4;&#x8BB0;&#x5F55;&#x5230;&#x7B14;&#x8BB0;&#x91CC;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x8BB0;&#x4E0B;&#x6765;&#x7136;&#x540E;&#x53BB;&#x7B14;&#x8BB0;&#x91CC;&#x67E5;&#x8BE2;&#xFF0C;&#x8DDF;&#x76F4;&#x63A5;&#x53BB;&#x89C2;&#x5BDF;&#x6216;&#x8005;&#x7528;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x641C;&#x7D22;&#x76F8;&#x6BD4;&#x8D77;&#x6765;&#x65F6;&#x95F4;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x4F18;&#x52BF;&#xFF08;&#x4E0D;&#x4EC5;&#x6CA1;&#x6709;&#x4F18;&#x52BF;&#xFF0C;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x662F;&#x8FD8;&#x8981;&#x5927;&#x5927;&#x7684;&#x4E8F;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x540E;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;&#xFF0C;&#x6015;&#x5FD8;&#x8BB0;&#xFF0C;&#x90A3;&#x66F4;&#x9002;&#x5408;&#x5199;&#x8FDB; Todo List &#x6216;&#x4FBF;&#x7B7E;&#x91CC;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8FDB;&#x4E00;&#x6B65;&#x6316;&#x6398;&#x4FE1;&#x606F;&#x540E;&#x5F97;&#x5230;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x4FBF;&#x662F;&#x77E5;&#x8BC6;&#xFF0C;&#x503C;&#x5F97;&#x4E00;&#x8BB0;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x4F55;&#x5229;&#x7528; LinearLayout &#x505A;&#x4E00;&#x4E2A;&#x5E95;&#x90E8;&#x83DC;&#x5355;&#x680F;&#x7684;&#x9875;&#x9762;&#xFF1F;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x7C7B;&#x4F3C;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&lt;/p&gt;
&lt;pre&gt;&lt;code class=""&gt;&amp;lt;LinearLayout xmlns:android=&amp;quot;http://schemas.android.com/apk/res/android&amp;quot;
    android:layout_width=&amp;quot;match_parent&amp;quot;
    android:layout_height=&amp;quot;match_parent&amp;quot;
    android:orientation=&amp;quot;vertical&amp;quot; &amp;gt;

    &amp;lt;fragment
        android:id=&amp;quot;@+id/content&amp;quot;
        android:layout_width=&amp;quot;match_parent&amp;quot;
        android:layout_height=&amp;quot;0dip&amp;quot;
        android:layout_weight=&amp;quot;1&amp;quot;
        android:padding=&amp;quot;0dp&amp;quot; /&amp;gt;

    &amp;lt;fragment
        android:id=&amp;quot;@+id/footer&amp;quot;
        android:layout_width=&amp;quot;match_parent&amp;quot;
        android:layout_height=&amp;quot;wrap_content&amp;quot;
        android:layout_weight=&amp;quot;0&amp;quot; /&amp;gt;
&amp;lt;/LinearLayout&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x867D;&#x7136;&#x76F4;&#x63A5;&#x8D34;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x5177;&#x4F53;&#x7684;&#x4EE3;&#x7801;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x50CF;&#x6A21;&#x677F;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x590D;&#x5236;&#x9ECF;&#x8D34;&#x518D;&#x4FEE;&#x6539;&#x6210;&#x81EA;&#x5DF1;&#x8981;&#x7684;&#x6548;&#x679C;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x5E76;&#x4E0D;&#x7406;&#x89E3;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5077;&#x61D2;&#x5C31;&#x4EC5;&#x628A;&#x5B83;&#x8BB0;&#x5230; notes &#x91CC;&#xFF0C;&#x4EE5;&#x540E;&#x9700;&#x8981;&#x7528;&#x5230;&#x8FD9;&#x79CD;&#x5E03;&#x5C40;&#xFF0C;&#x6765;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x4E00;&#x4EFD;&#x5C31;&#x662F;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x4E86;&#x89E3;&#x4E86;&#x6E90;&#x7801;&#xFF08;&lt;code&gt;LinearLayout#onMeasure&lt;/code&gt;&#x8FD9;&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x624D;&#x660E;&#x767D;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x5982;&#x4F55;&#x5DE7;&#x5999;&#x5730;&#x5229;&#x7528; &lt;code&gt;weight&lt;/code&gt; &#x7684;&#x3002;&#x4EE5;&#x5BBD;&#x5EA6;&#x4E3A;&#x4F8B;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x5148;&#x6D4B;&#x91CF;&#x5404;&#x4E2A;&#x63A7;&#x4EF6;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x5F97;&#x5230;&#x5269;&#x4E0B;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x628A;&#x5269;&#x4E0B;&#x7684;&#x7A7A;&#x95F4;&#x6309;&#x7167; &lt;code&gt;weight&lt;/code&gt; &#x5206;&#x914D;&#x7ED9;&#x5404;&#x4E2A;&#x7EC4;&#x4EF6;&#x3002;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x8981;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x6B7B;&#x8BB0;&#x4E86;&#xFF0C;&#x4EE5;&#x540E;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x6D3B;&#x7528;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#x81EA;&#x5DF1;&#x7406;&#x89E3;&#x51FA;&#x6765;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5C31;&#x503C;&#x5F97;&#x4E00;&#x8BB0;&#xFF0C;&#x4F46;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8BB0;&#x5F55;&#x5230;&#x7B14;&#x8BB0;&#x91CC;&#x5C31;&#x5B8C;&#x4E86;&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x8F85;&#x52A9;&#x8BB0;&#x5FC6;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x6709;&#x8BB0;&#x5230;&#x8111;&#x5B50;&#x91CC;&#x624D;&#x80FD;&#x53D1;&#x6325;&#x77E5;&#x8BC6;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x8E66;&#x51FA;&#x6765;&#x4E3A;&#x81EA;&#x5DF1;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x518D;&#x4E3E;&#x4E2A;&#x8FD8;&#x6CA1;&#x6709;&#x638C;&#x63E1;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6BD4;&#x5982; Emacs&#xFF0C;&#x5076;&#x5C14;&#x53D1;&#x73B0; Emacs &#x5C45;&#x7136;&#x8FD8;&#x6709;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x547D;&#x4EE4;&#xFF0C;&#x4FBF;&#x4E0D;&#x81EA;&#x89C9;&#x5F97;&#x8981;&#x628A;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x7528;&#x6CD5;&#x548C;&#x5FEB;&#x6377;&#x952E;&#x8BB0;&#x8D77;&#x6765;&#xFF0C;&#x4F46;&#x6B7B;&#x8BB0;&#x547D;&#x4EE4;&#x5927;&#x591A;&#x662F;&#x65E0;&#x7528;&#x529F;&#xFF0C;&#x6216;&#x4E00;&#x76F4;&#x4E0D;&#x9700;&#x7528;&#x5230;&#x4E5F;&#x5C31;&#x5F88;&#x96BE;&#x8BB0;&#x4F4F;&#xFF0C;&#x6216;&#x5E38;&#x7528;&#x7528;&#x591A;&#x51E0;&#x6B21;&#x4E5F;&#x5C31;&#x8BB0;&#x4F4F;&#x3002; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B66;&#x4F1A;&#x5982;&#x4F55;&#x5229;&#x7528;&#x5185;&#x5EFA;&#x6587;&#x6863;&#xFF0C;&#x5B66;&#x4F1A;&#x5FEB;&#x901F;&#x67E5;&#x627E;&#x5230;&#x60F3;&#x8981;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E0D;&#x662F;&#x6BD4;&#x5355;&#x7EAF;&#x8BB0;&#x4E0B;&#x51E0;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x7528;&#x6CD5;&#x548C;&#x4F5C;&#x7528;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4EE5;&#x540E;&#x518D;&#x6B7B;&#x8BB0;&#x547D;&#x4EE4;&#x7684;&#x82E6;&#x607C;&#x3002;&#x4F46;&#x7528;&#x4E86;&#x51E0;&#x5E74; Emacs &#x6211;&#x4ECE;&#x7CFB;&#x7EDF;&#x5730;&#x5B66;&#x4E60;&#x8FC7;&#xFF0C;&#x771F;&#x662F;&#x601D;&#x60F3;&#x6709;&#x95EE;&#x9898;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4EC0;&#x4E48;&#x53EF;&#x79F0;&#x4E3A;&#x601D;&#x60F3;&#x3002;&#x6BD4;&#x5982;&#xFF0C;objc &#x7684;&#x4F8B;&#x5B50;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x662F;&#x4FE1;&#x606F;&#x5C42;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5BF9;&#x4E0D;&#x61C2;&#x7F16;&#x7A0B;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x90A3;&#x8FDE;&#x4FE1;&#x606F;&#x90FD;&#x4E0D;&#x7B97;&#xFF0C;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x566A;&#x97F3;&#x3002;&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x638C;&#x63E1;&#x6574;&#x4E2A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x601D;&#x60F3;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x624D;&#x771F;&#x6B63;&#x6210;&#x4E3A;&#x4FE1;&#x606F;&#x3002;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x8D34;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x5806;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#xFF0C;&#x5B83;&#x4F9D;&#x9644;&#x4E8E; Android &#x5E03;&#x5C40;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x4F9D;&#x9644;&#x4E8E; xml &#x6807;&#x8BB0;&#x8BED;&#x8A00;&#xFF0C;&#x518D;&#x518D;&#x518D;&#x5F80;&#x4E0B;&#x8FD8;&#x53EF;&#x4EE5;&#x5230;&#x8FBE;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x548C;&#x4FE1;&#x606F;&#x79D1;&#x5B66;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x7136;&#x540E;&#x8FD8;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x8FFD;&#x6EAF;&#xFF0C;&#x6574;&#x4E2A;&#x5C31;&#x662F;&#x4EBA;&#x7C7B;&#x77E5;&#x8BC6;&#x53D1;&#x5C55;&#x7684;&#x8F68;&#x8FF9;&#x3002;&#x5BF9;&#x4E8E;&#x6F2B;&#x5929;&#x98DE;&#x821E;&#x7684;&#x4FE1;&#x606F;&#x788E;&#x7247;&#xFF0C;&#x9700;&#x8981;&#x627E;&#x5230;&#x4E00;&#x6761;&#x901A;&#x5F80;&#x5730;&#x9762;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x624D;&#x80FD;&#x4EA7;&#x751F;&#x610F;&#x4E49;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x5730;&#x9762;&#x5C31;&#x662F;&#x601D;&#x60F3;&#x6240;&#x5728;&#x3002;&#x867D;&#x7136;&#x662F;&#x4E2A;&#x5F88;&#x7A7A;&#x6CDB;&#x7684;&#x6BD4;&#x55BB;&#xFF0C;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x571F;&#x58E4;&#x548C;&#x6E90;&#x6CC9;&#xFF0C;&#x6ECB;&#x517B;&#x51FA;&#x77E5;&#x8BC6;&#x7684;&#x5927;&#x6811;&#xFF0C;&#x4FE1;&#x606F;&#x662F;&#x53F6;&#x5B50;&#x4E0A;&#x7684;&#x8109;&#x7EDC;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x53EA;&#x662F;&#x6CDB;&#x6CDB;&#x5176;&#x8BCD;&#xFF0C;&#x6709;&#x70B9;&#x4E0D;&#x77E5;&#x600E;&#x4E48;&#x7EE7;&#x7EED;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5BF9;&#x7B14;&#x8BB0;&#x7684;&#x4E00;&#x70B9;&#x70B9;&#x601D;&#x8003;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&lt;a href="/2013/10/22/the-pain-of-note-2" title=""&gt;&#x6574;&#x7406;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x7684;&#x7F3A;&#x70B9;&lt;/a&gt;&#xFF0C;&#x624D;&#x7B97;&#x56DE;&#x5F52;&#x4E3B;&#x9898;&#xFF0C;&#x547C;&#x5E94;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x6587;&#x5B66;&#x822C;&#x9738;&#x6C14;&#x7684;&#x6807;&#x9898;&#x3002;&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x521D;&#x5C1D; Android Studio</title>
      <link>https://douo.github.io/moon-2013//2013/05/29/first-glance-in-android-studio</link>
      <pubDate>2013-05-29</pubDate>
      <description>&lt;p&gt;Google I/O 2013 &#x653E;&#x51FA;&#x7684;&#x65B0; Android IDE&#xFF0C;&#x57FA;&#x4E8E; IntelliJ IDEA&#xFF0C;&#x73B0;&#x5728;&#x8FD8;&#x53EA;&#x662F;&#x65E9;&#x671F;&#x9884;&#x89C8;&#x7248;&#x672C;&#x3002;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x7528;&#x4E86;&#x51E0;&#x5929;&#x540E;&#xFF0C;&#x5F97;&#x51FA;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF0C;&#x5F3A;&#x70C8;&#x4E0D;&#x5EFA;&#x8BAE;&#x7528;&#x6765;&#x4F5C;&#x6B63;&#x5F0F;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x770B;&#x5B83;&#x7684;&#x7248;&#x672C;&#x540D;&#x5C31;&#x77E5;&#x9053;&#x3002;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x4E0D;&#x5B8C;&#x5584;&#xFF0C;&#x4ECE;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x9879;&#x76EE;&#x5230;&#x6253;&#x5305;&#x8FD0;&#x884C;&#xFF0C;&#x9047;&#x5230;&#x95EE;&#x9898;&#x4E0D;&#x65AD;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x6253;&#x5305;&#x901F;&#x5EA6;&#x6162;&#x3002;&#x4E00;&#x53F0; E5200 &#x7684; Win7&#xFF0C;&#x4E00;&#x6B21; clean &#x8981;&lt;strong&gt;10&#x79D2;&lt;/strong&gt;&#x4EE5;&#x4E0A;&#xFF0C;&#x7136;&#x540E; compileDebug &#x8981;&lt;strong&gt;30&#x79D2;&lt;/strong&gt;&#x3002;&#x4E00;&#x53F0; i5-3550 &#x540C;&#x65F6;&#x914D;&#x5907;&#x6709;&#x56FA;&#x6001;&#x786C;&#x76D8;&#x7684; Hackintosh&#xFF0C; clean &#x4E00;&#x6B21;&#x4ECD;&#x8981;&lt;strong&gt;5&#x79D2;&lt;/strong&gt;&#xFF0C;compileDebug &#x8981;&lt;strong&gt;15&#x79D2;&lt;/strong&gt;&#x3002;&#x800C;&#x4E14;&#x82B1;&#x5728; checkSource &#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x591A;&#x3002;&#x505A;&#x4E00;&#x4E2A;&#x5C0F;&#x6539;&#x52A8;&#x518D;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x4E5F;&#x8981;&#x7B49;&#x5F88;&#x4E45;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E25;&#x91CD;&#x62D6;&#x6162;&#x5F00;&#x53D1;&#x6548;&#x7387;&#xFF08;&#x6709;&#x8FD9;&#x4E2A;&#x7A7A;&#x9699;&#x603B;&#x4F1A;&#x4E0D;&#x81EA;&#x89C9;&#x5730;&#x53BB;&#x5237;&#x5237; reader&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x66F4;&#x591A;&#x7684;&#x62D6;&#x5EF6;&#xFF09;&#x3002;&#x76EE;&#x524D;&#x6CA1;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53EF;&#x80FD;&#x662F; groovy &#x3001;gradle &#x672C;&#x8EAB;&#x7684;&#x5C40;&#x9650;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x73B0;&#x5728;&#x8FD9;&#x4E2A; New Build System &#x4E5F;&#x8FD8;&#x4E0D;&#x5B8C;&#x5584;&#xFF0C;&#x73B0;&#x5728;&#x7248;&#x672C;&#x624D;&#x662F;0.3&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6539;&#x8FDB;&#x7A7A;&#x95F4;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x7528; &lt;a href="http://www.gradle.org/docs/current/userguide/gradle_daemon.html" title=""&gt;daemon&lt;/a&gt; &#x6A21;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E0D;&#x8FC7;&#xFF0C;Android Studio &#x8FD8;&#x662F;&#x5F88;&#x8BA9;&#x4EBA;&#x671F;&#x5F85;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x770B;&#x8FC7; &lt;a href="http://www.youtube.com/watch?v=lmv1dTnhLH4" title=""&gt;&amp;quot;What&amp;#39;s new in Android Developer Tools&amp;quot;&lt;/a&gt; &#x91CC;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x90A3;&#x4E9B;&#x5F88;&#x9177;&#x7684;&#x7279;&#x6027;&#x3002;&#x7EC8;&#x4E8E;&#x53EF;&#x4EE5;&#x6446;&#x8131; Eclipse &#x7684;&#x4E00;&#x4E9B;&#x987D;&#x75BE;&#x548C;&#x90A3;&#x8001;&#x6C14;&#x6C89;&#x6C89;&#x7684; UI &#x4E86;&#xFF08;&#x6211;&#x662F; Swing &#x7231;&#x597D;&#x8005;&#xFF0C;&#x6CA1;&#x505A; Android &#x4E4B;&#x524D; Netbeans &#x624D;&#x662F;&#x6211;&#x7684;&#x65E5;&#x5E38;IDE&#xFF0C;&#x53EF;&#x60DC; ADT &#x6CA1; Netbeans &#x7684;&#x4EFD;&#xFF09;&#x3002;&#x6446;&#x8131;&#x4E86; Eclipse &#x540E;&#xFF0C;Android IDE &#x624D;&#x80FD;&#x6709;&#x66F4;&#x5927;&#x53D1;&#x6325;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x65B0; Layout Design &#xFF0C;&#x4E0D;&#x5FC5;&#x518D;&#x671B; Interface Builder &#x7A7A;&#x53F9;&#x4E86;&#x3002;&#x800C; JetBrains &#x4E5F;&#x662F;&#x58F0;&#x540D;&#x5728;&#x5916;&#xFF0C;&#x4E0A;&#x6B21;&#x5B83;&#x5728;&#x56FD;&#x5185;&#x505A;&#x6D3B;&#x52A8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5DEE;&#x70B9;&#x4E70;&#x4E86; AppCode &#x548C; RubyMine&#x3002;&#x81F3;&#x4E8E; IntelliJ IDEA &#x6211;&#x7B97;&#x662F;&#x4E45;&#x4EF0;&#x5176;&#x540D;&#xFF0C;&#x672A;&#x89C1;&#x5176;&#x9762;&#x5427;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x8BD5;&#x7528;&#x8FC7;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F53;&#x65F6;&#x662F;&#x975E; Android &#x5B98;&#x65B9;&#x652F;&#x6301;&#x7684;&#xFF0C;&#x4E0D;&#x6562;&#x968F;&#x4FBF;&#x5C31;&#x5207;&#x6362;&#x8FC7;&#x53BB;&#x3002;&#x6700;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x4ECE; Eclipse &#x5207;&#x6362; &#x5230; IntelliJ IDEA &#x7684;&#x6210;&#x672C;&#x5176;&#x5B9E;&#x4E0D;&#x9AD8;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&lt;a href="http://confluence.jetbrains.com/display/IDEADEV/Structure+of+IntelliJ+IDEA+Project" title=""&gt;&#x6982;&#x5FF5;&lt;/a&gt;&#x7684;&#x6DF7;&#x6DC6;&#x3002;&#x4F46;&#x90FD;&#x6709; Emacs Keymap&#xFF0C;&#x8FD8;&#x6709;&#x6700;&#x86CB;&#x75BC;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x73B0;&#x5728;&#x3000;Android&#x3000;Studio&#x3000;&#x8FD8;&#x53EA;&#x662F;&#x4E2A;&lt;strong&gt;&#x300C;&#x7F16;&#x8F91;&#x5668;&#x300D;&lt;/strong&gt;&#xFF0C;&#x6700;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x7684;&#x6253;&#x5305;&#x3001;&#x4F9D;&#x8D56;&#x95EE;&#x9898;&#xFF0C;&#x73B0;&#x5728;&#x505A;&#x5230;&#x3000;New Build System &#x4E86;&#xFF0C;&#x76EE;&#x524D;&#x8FD8;&#x6CA1;&#x6574;&#x5408;&#x8FDB; Android Studio&#x3002;&#x6240;&#x4EE5;&#x6253;&#x5305;&#x4F9D;&#x8D56;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x4F46;&#x8981;&#x5728; IDE &#x91CC;&#x914D;&#x7F6E;&#x4E00;&#x904D;&#xFF0C;&#x8FD8;&#x8981;&#x81EA;&#x5DF1;&#x5199;&#x4E0A;&#x4E00;&#x904D; &lt;code&gt;build.gradle&lt;/code&gt;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4EE5;&#x52A0;&#x5165; ActionBarSherlock &#x4E3A;&#x4F8B;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x4E0D;&#x4E86;&#x89E3;&#xFF0C;&#x5C1D;&#x8BD5;&#x4E86;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x56DB;&#x5904;&#x78B0;&#x58C1;&#x3002;&#x7528;&#x914D;&#x7F6E; IDE &#x7684;&#x65B9;&#x6CD5;&#x53EA;&#x80FD;&#x89E3;&#x51B3;&#x7F16;&#x7801;&#x65F6;&#x7684;&#x5F15;&#x7528;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x540E;&#x53EA;&#x6709; &lt;a href="http://stackoverflow.com/a/16639227/851344" title=""&gt;@froger_mcs&lt;/a&gt; &#x7684;&#x65B9;&#x6CD5;&#x662F;&#x53EF;&#x6210;&#x529F;&#x6253;&#x5305;&#x8FD0;&#x884C;&#x7684;&#x3002;&#x624D;&#x53D1;&#x73B0;&#x8981;&#x7528; Android Studio &#x4E86;&#x89E3;&#x4E0B; gradle &#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF08;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#x6211;&#x8FD8;&#x6CA1;&#x542C;&#x8BF4;&#x8FC7; gradle&#xFF09;&#x770B;&#x4E00;&#x4E0B; &lt;a href="http://www.gradle.org/docs/current/userguide/userguide_single.html#overview" title=""&gt;Gradle User Guide&lt;/a&gt;&#xFF0C;&#x6700;&#x5C11;&#x770B;&#x5B8C;&#x7B2C;&#x516D;&#x7AE0;&#xFF0C;&#x5C31;&#x6709;&#x70B9;&#x6982;&#x5FF5;&#x4E86;&#x3002;&#x540E;&#x6765;&#x518D;&#x770B;&#x4E86; I/O &#x7684;&#x8BB2;&#x5EA7; &lt;a href="https://www.youtube.com/watch?v=LCJAgPkpmR0" title=""&gt;&amp;quot;The New Android SDK Build System&amp;quot;&lt;/a&gt;&#xFF0C;&#x8C41;&#x7136;&#x5F00;&#x6717;&#x3002;&#x624D;&#x77E5;&#x9053;&#x539F;&#x6765; Android &#x63A8;&#x51FA;&#x4E86;&#x4E2A;&#x65B0;&#x7684;&#x57FA;&#x4E8E; gradle &#x7684;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x3002;&lt;a href="http://tools.android.com/tech-docs/new-build-system/user-guide" title=""&gt;&#x8FD9;&#x91CC;&lt;/a&gt;&#x662F;&#x8BE6;&#x7EC6;&#x7684;&#x6587;&#x6863;&#x3002;&#x8FD8;&#x6709;&#xFF0C;New Android Build System &#x9700;&#x8981; gradle 1.6&#xFF0C; brew &#x53EA;&#x80FD;&#x4E0B;&#x8F7D;&#x5230; 1.5&#x3002;&lt;/p&gt;

&lt;p&gt;IntelliJ IDEA &#x9ED8;&#x8BA4;&#x7684; Emacs Keymap &#x6BD4; Eclipse &#x9ED8;&#x8BA4;&#x7684;&#x597D;&#x7528;&#xFF0C;&#x867D;&#x7136;&#x8FD8;&#x6BD4;&#x4E0D;&#x4E0A; Emacs+&#xFF0C;&#x6BD4;&#x5982;&lt;code&gt;c-x c-b&lt;/code&gt; &#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x4F46;&#x80DC;&#x5728;&#x8DB3;&#x591F;&#x7A33;&#x5B9A;&#xFF0C;&#x8D34;&#x5408;&#x7CFB;&#x7EDF;&#x3002;&#x4E0D;&#x8FC7;&#x5728; Mac &#x4E0B;&#x5C31;&#x6CA1;&#x90A3;&#x4E48;&#x597D;&#x4E86;&#xFF0C;option &#x952E;&#x4ECD;&#x4E0E; meta &#x952E;&#x51B2;&#x7A81;&#xFF08;Aquamacs &#x4E2D;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF09;&#xFF0C;&#x6700;&#x540E;&#x53EA;&#x80FD;&#x7528;&#x4E00;&#x4E2A;&#x65B0;&#x7684; keyboard layout &#x5C4F;&#x853D;&#x6389; option &#x8F93;&#x5165;&#x5B57;&#x7B26;&#x5FEB;&#x6377;&#x952E;&#xFF08;option &#x914D;&#x5408;&#x5B57;&#x6BCD;&#x952E;&#x8F93;&#x5165;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#xFF0C;&#x6211;&#x600E;&#x4E48;&#x89C9;&#x5F97;&#x662F;&#x4E2A;&#x4E0D;&#x600E;&#x4E48;&#x5B9E;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF09;&#xFF0C;&#x624D;&#x80FD;&#x4F5C;&#x4E3A; meta &#x952E;&#x4F7F;&#x7528;&#x3002;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#x6309;&#x7167; &lt;a href="http://stackoverflow.com/questions/11876485/how-to-disable-typing-special-characters-when-pressing-option-key-in-mac-os-x" title=""&gt;@dan&lt;/a&gt; &#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A; layout &#x4E0D;&#x80FD;&#x5728; Aquamacs &#x4E2D;&#x8F93;&#x5165;&#x5B57;&#x7B26;&#xFF0C;&#x6765;&#x56DE;&#x5207;&#x6362;&#x4E5F;&#x9EBB;&#x70E6;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8FD8;&#x6709; git &#xFF0C;IntelliJ IDEA &#x9ED8;&#x8BA4;&#x5C31;&#x652F;&#x6301; git&#xFF0C;&#x6211;&#x4E4B;&#x524D;&#x5C31;&#x914D;&#x7F6E;&#x597D; cygwin &#x4E0B;&#x7684; git &#x73AF;&#x5883;&#x3002;&#x5B83;&#x8FD8;&#x80FD;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x5230; cygwin &#xFF0C;&#x5E76;&#x7528; cygwin &#x7684; git &#x6765;&#x63D0;&#x4EA4;&#x3002;&lt;code&gt;.gitignore&lt;/code&gt; &#x4E0D;&#x77E5;&#x8BE5;&#x5982;&#x4F55;&#x5199;&#xFF0C;&#x76F4;&#x63A5;&#x628A;&#x4ED3;&#x5E93;&#x5EFA;&#x5728; src &#x76EE;&#x5F55;&#x4E0B;&#x662F;&#x6700;&#x65B9;&#x4FBF;&#x7684;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E4B;&#x524D;&#x7528; Eclipse Helios &#x603B;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x5047;&#x6B7B;&#x548C;&#x7A81;&#x7136;&#x5D29;&#x6E83;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x662F; ADT &#x7684; bug&#x3002;&#x5347;&#x7EA7;&#x5230; Juno &#x540E;&#x597D;&#x50CF;&#x4E0D;&#x4F1A;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7; Juno &#x8981;&#x914D;&#x5408; Emacs+ &#x4E5F;&#x9700;&#x8981;&#x4E00;&#x756A;&#x6298;&#x817E;&#xFF0C;&#x73B0;&#x5728;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#x73B0;&#x5728;&#x7528;&#x7684; Eclipse &#x597D;&#x50CF;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x7A33;&#x5B9A;&#x4E86;&#xFF0C;&#x76F8;&#x6BD4; Xcode &#xFF0C;ADT &#x8FD8;&#x662F;&#x6709;&#x6240;&#x6B20;&#x7F3A;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x53EF;&#x89C6;&#x5316;&#x7F16;&#x8F91;&#x65B9;&#x9762;&#xFF0C;&#x5374;&#x4E5F;&#x8DB3;&#x591F;&#x6EE1;&#x8DB3;&#x57FA;&#x672C;&#x9700;&#x6C42;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x574F;&#x7656;&#x597D;&#x73B0;&#x5728;&#x6CA1;&#x4EC0;&#x4E48;&#x7406;&#x7531;&#x5207;&#x6362;&#x5230; Android Studio &#x53BB;&#x505A;&#x767D;&#x8001;&#x9F20;&#x3002;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x589E;&#x91CF;&#x66F4;&#x65B0;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x4E0B;&#x8F7D;&#x4E2A;&#x653E;&#x7740;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#x3002;&#x6211;&#x8FD8;&#x662F;&#x7EE7;&#x7EED;&#x575A;&#x6301;&#x4F7F;&#x7528;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x4F1A;&#x53CA;&#x65F6;&#x8BB0;&#x5F55;&#x5230;&lt;a href="/notes/tools/android-studio" title=""&gt;&#x7B14;&#x8BB0;&lt;/a&gt;&#x91CC;&#x3002;&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x535A;&#x5BA2;&#x4E3A;&#x8C01;&#x800C;&#x5199;</title>
      <link>https://douo.github.io/moon-2013//2013/03/17/for-whom-the-blog-tolls</link>
      <pubDate>2013-03-17</pubDate>
      <description>&lt;p&gt;&#x672C;&#x6765;&#x53EA;&#x662F;&#x60F3;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x5E74;&#x524D;&#x4E00;&#x76F4;&#x6298;&#x817E;&#x7684;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#xFF0C;&#x6070;&#x597D;&#x78B0;&#x5230;&#x4E86;&#x8C37;&#x6B4C;&#x6253;&#x7B97;&#x5173;&#x95ED; reader&#xFF0C;&#x4E00;&#x95EA;&#x5FF5;&#x4FBF;&#x6253;&#x4E0B;&#x4E86;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#xFF0C;&#x6BD5;&#x7ADF;&#x7A81;&#x5982;&#x5176;&#x6765;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x6572;&#x54CD;&#x535A;&#x5BA2;&#x7684;&#x4E27;&#x949F;&#xFF0C;&#x96BE;&#x514D;&#x6292;&#x6000;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x73B0;&#x5728;&#x6700;&#x4F9D;&#x8D56; Google Reader &#x7684;&#x5C31;&#x662F;&#x4E0A;&#x4E0B;&#x73ED;&#x5728;&#x516C;&#x8F66;&#x4E0A;&#x7684;&#x90A3;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x914D;&#x5408; &lt;a href="https://play.google.com/store/apps/details?id=com.noinnion.android.greader.reader" title=""&gt;gReader&lt;/a&gt; &#x7684;&#x79BB;&#x7EBF;&#x529F;&#x80FD;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x9605;&#x8BFB;&#x5341;&#x5206;&#x8212;&#x670D;&#x3002;&#x6211;&#x8BA2;&#x9605;&#x4E00;&#x4E9B; IT &#x8D44;&#x8BAF;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x5173;&#x5FC3;&#xFF0C;&#x4F46;&#x4ED6;&#x4F1A;&#x6210;&#x4E3A;&#x6211;&#x7684;&#x4E00;&#x4E9B;&#x8C08;&#x8D44;&#xFF0C;&#x6BD5;&#x7ADF;&#x5728;&#x522B;&#x4EBA;&#x773C;&#x4E2D;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x8D44;&#x8BAF;&#xFF0C;&#x8BA2;&#x9605;&#x5728; Reader &#x53EF;&#x4EE5;&#x5F3A;&#x8FEB;&#x6211;&#x9605;&#x8BFB;&#x3002;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E8C;&#x624B;&#x4EA4;&#x6613;&#x8BBA;&#x575B;&#xFF0C;&#x4E4B;&#x524D;&#x60F3;&#x6536;&#x7535;&#x5B50;&#x4EA7;&#x54C1;&#xFF0C;&#x6301;&#x7EED;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5173;&#x6CE8;&#x4E8C;&#x624B;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x4E70;&#x5230;&#x6BD4;&#x8F83;&#x9760;&#x8C31;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x5173;&#x5FC3;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x5F97;&#x5168;&#x90E8;&#x6807;&#x8BB0;&#x4E3A;&#x5DF2;&#x8BFB;&#xFF0C;&#x5E78;&#x597D; &lt;a href="https://play.google.com/store/apps/details?id=com.noinnion.android.greader.reader" title=""&gt;gReader&lt;/a&gt; &#x6709;&#x8FC7;&#x6EE4;&#x529F;&#x80FD;&#x3002;&#x6211;&#x53D1;&#x89C9;&#x8BBA;&#x575B;&#x7684; RSS &#x914D;&#x5408; Reader &#x7684;&#x641C;&#x7D22;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x6211;&#x771F;&#x6B63;&#x5173;&#x5FC3;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6162;&#x6162;&#x6C89;&#x6DC0;&#x4E0B;&#x6765;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x6709;&#x4E9B; apps &#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x4F60;&#x7684;&#x9605;&#x8BFB;&#x4E60;&#x60EF;&#x6765;&#x63A8;&#x9001;&#x5185;&#x5BB9;&#x3002;&#x6211;&#x6709;&#x70B9;&#x62B5;&#x89E6;&#x8FD9;&#x6837;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5E73;&#x5E38;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#xFF0C;&#x6B63;&#x6587;&#x4E4B;&#x5916;&#x4E5F;&#x5145;&#x6EE1;&#x63A8;&#x8350;&#x94FE;&#x63A5;&#xFF0C;&#x5F3A;&#x8FEB;&#x4F60;&#x53BB;&#x63A5;&#x53D7;&#x90A3;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x4F60;&#x603B;&#x4F1A;&#x88AB;&#x5176;&#x4E2D;&#x67D0;&#x4E9B;&#x5438;&#x5F15;&#xFF0C;&#x4E0D;&#x81EA;&#x89C9;&#x7684;&#x70B9;&#x6765;&#x70B9;&#x53BB;&#x3002;&#x5982;&#x4E00;&#x4E2A;&#x541E;&#x566C;&#x65F6;&#x95F4;&#x7684;&#x9ED1;&#x6D1E;&#x3002;&#x4E2A;&#x6027;&#x5316;&#x63A8;&#x8350;&#x5C31;&#x662F;&#x66F4;&#x5C0F;&#x8303;&#x56F4;&#x5185;&#x7684;&#x540C;&#x6837;&#x6A21;&#x5F0F;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x76F8;&#x5BF9;&#x6BD4;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x66F4;&#x5BF9;&#x4EBA;&#x4E5F;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x6211;&#x8BA2;&#x9605;&#x4E86;&#x4E0D;&#x5C11;&#x72EC;&#x7ACB;&#x535A;&#x5BA2;&#xFF0C;&#x4ECE;&#x4ED6;&#x4EEC;&#x6280;&#x672F;&#x6587;&#x7AE0;&#x4E4B;&#x5916;&#x900F;&#x9732;&#x51FA;&#x6765;&#x7684;&#x53EA;&#x8A00;&#x7247;&#x8BED;&#xFF0C;&#x53BB;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x52C9;&#x52B1;&#x548C;&#x6307;&#x5BFC;&#x3002;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x5219;&#x8D8A;&#x6765;&#x8D8A;&#x88AB;&#x52A8;&#x4E86;&#xFF0C;&#x5927;&#x591A;&#x90FD;&#x662F;&#x9047;&#x5230;&#x95EE;&#x9898;&#x624D;&#x4F1A;&#x53BB;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x5F3A;&#x5927;&#x4E86;&#xFF0C;&#x57FA;&#x672C;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x535A;&#x5BA2;&#x7684;&#x4E00;&#x79CD;&#x4F5C;&#x7528;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x6D89;&#x53CA;&#x7684;&#x95EE;&#x9898;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x591A;&#x592A;&#x6742;&#x4F46;&#x53C8;&#x6D41;&#x4E8E;&#x8868;&#x9762;&#xFF0C;&#xFF0C;&#x6240;&#x4EE5;&#x76F8;&#x6BD4;&#x6298;&#x817E;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4F1A;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x7528;&#x4E00;&#x6BB5;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x7CFB;&#x7EDF;&#x7684;&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x7AD9;&#x5728;&#x66F4;&#x9AD8;&#x7684;&#x7EF4;&#x5EA6;&#x624D;&#x80FD;&#x770B;&#x5230;&#x66F4;&#x6E05;&#x695A;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x6837;&#x662F;&#x4E0D;&#x9002;&#x5408;&#x4E8E;&#x5728;&#x8FD9;&#x4E2A;&#x5FEB;&#x8282;&#x594F;&#x7684;&#x5E02;&#x573A;&#x751F;&#x5B58;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x76EE;&#x524D;&#x770B;&#x6765;&#x5F88;&#x5403;&#x4E8F;&#x3002;&#x5728;&#x7231;&#x597D;&#x4E0E;&#x5229;&#x76CA;&#x4E4B;&#x95F4;&#x6211;&#x4E5F;&#x6447;&#x6446;&#x4E0D;&#x5B9A;&#x3002;&#x6BD5;&#x7ADF;&#x73B0;&#x5728;&#x751F;&#x6D3B;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#xFF0C;&#x4E00;&#x70B9;&#x94B1;&#x6362;&#x6765;&#x4E00;&#x4E9B;&#x751F;&#x6D3B;&#x7684;&#x57FA;&#x7840;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FD8;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x8FD9;&#x4E0E;&#x4EE5;&#x524D;&#x6240;&#x8BA4;&#x4E3A;&#x7684;&#x6CE8;&#x91CD;&#x57FA;&#x7840;&#x53C8;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4EE5;&#x524D;&#x9047;&#x5230;&#x95EE;&#x9898;&#x5C31;&#x4E60;&#x60EF;&#x4E86;&#x53BB;&#x6DF1;&#x6316;&#x4ED6;&#xFF0C;&#x73B0;&#x5728;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x907F;&#x514D;&#x6DF1;&#x9677;&#x8FD9;&#x6837;&#x7684;&#x6CE5;&#x6F6D;&#x3002; &lt;/p&gt;

&lt;p&gt;&#x8BF4;&#x8D77;&#x4EBA;&#xFF0C;&#x65E0;&#x6CD5;&#x907F;&#x5F00;&#x7684;&#x662F;&#x90A3;&#x4E9B;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x3002;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8BA2;&#x9605;&#x72EC;&#x7ACB;&#x535A;&#x5BA2;&#xFF0C;&#x800C;&#x4E0D;&#x53BB; fo &#x535A;&#x4E3B;&#x7684;&#x5FAE;&#x535A;&#x5462;&#xFF1F;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#xFF0C;&#x6211;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x4E0D;&#x4EE3;&#x8868;&#x6211;&#x5BF9;&#x4ED6;&#x665A;&#x996D;&#x5403;&#x4EC0;&#x4E48;&#x4E5F;&#x611F;&#x5174;&#x8DA3;&#x5427;&#x3002;&#x5FAE;&#x535A;&#x592A;&#x7410;&#x788E;&#xFF0C;&#x592A;&#x751F;&#x6D3B;&#x4E86;&#xFF0C;&#x51E0;&#x5E74;&#x524D;&#x7528; twitter &#x7684;&#x65F6;&#x5019;&#x5C31;&#x611F;&#x53D7;&#x8FC7;&#x5982;&#x6F6E;&#x6C34;&#x822C;&#x7684;&#x4FE1;&#x606F;&#x6D41;&#x662F;&#x5982;&#x4F55;&#x541E;&#x566C;&#x6389;&#x65F6;&#x95F4;&#x7684;&#xFF0C;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x788E;&#x7247;&#x65F6;&#x95F4;&#x5C31;&#x6CA1;&#x4E86;&#xFF0C;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#x4E5F;&#x6CA1;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x4E2A;&#x4EBA;&#x81EA;&#x5236;&#x529B;&#x7684;&#x95EE;&#x9898;&#x3002;&#x800C;&#x535A;&#x5BA2;&#x4E24;&#x5B57;&#xFF0C;&#x81EA;&#x6709;&#x5B83;&#x7684;&#x5206;&#x91CF;&#xFF0C;&#x4F1A;&#x8BA9;&#x535A;&#x4E3B;&#x53D8;&#x5F97;&#x6709;&#x8D23;&#x4EFB;&#x628A;&#x4ED6;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x6700;&#x597D;&#x7684;&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x51FA;&#x6765;&#x3002;&#x6BCF;&#x4E2A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x535A;&#x4E3B;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x541D;&#x60DC;&#x81EA;&#x5DF1;&#x535A;&#x5BA2;&#x4E0A;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x535A;&#x5BA2;&#x4E0A;&#x770B;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x76F8;&#x5BF9;&#x6709;&#x4EF7;&#x503C;&#x7684;&#xFF0C;&#x6BCF;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x751F;&#x547D;&#x529B;&#x6BD4;&#x5FAE;&#x535A;&#x5F3A;&#x4E86;&#x4E0D;&#x77E5;&#x591A;&#x5C11;&#x3002;&#x5F53;&#x7136;&#x5BF9;&#x5FAE;&#x535A;&#x8FD8;&#x662F;&#x65E0;&#x6CD5;&#x656C;&#x800C;&#x8FDC;&#x4E4B;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x4F60;&#x786E;&#x5B9E;&#x4F1A;&#x60F3;&#x5173;&#x5FC3;&#x4ED6;&#x665A;&#x996D;&#x5403;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x53D1;&#x4E2A;&#x65E0;&#x5173;&#x7684;&#x5F15;&#x7528;&#xFF1A;&lt;/p&gt;

&lt;blockquote&gt;
&lt;p&gt;#&#x77E5;&#x4E4E;&#x95EE;&#x7B54;# &#x600E;&#x4E48;&#x770B;&#x5F85;&#x6BCF;&#x6B21;&#x5403;&#x996D;&#x524D;&#xFF0C;&#x90FD;&#x8981;&#x300C;&#x62CD;&#x7167;&#x53D1;&#x5FAE;&#x535A;&#x300D;&#x7684;&#x884C;&#x70BA;&#xFF1F; @GayScript&#xFF1A;&#x73B0;&#x5728;&#x56FD;&#x5185;&#x98DF;&#x54C1;&#x95EE;&#x9898;&#x4E25;&#x5CFB;&#xFF0C;&#x5403;&#x996D;&#x524D;&#x62CD;&#x4E2A;&#x7167;&#x53D1;&#x5FAE;&#x8584;&#xFF0C;&#x8FD9;&#x6837;&#x4E07;&#x4E00;&#x5403;&#x5B8C;&#x996D;&#x98DF;&#x7269;&#x4E2D;&#x6BD2;&#x53BB;&#x533B;&#x9662;&#x4E86;&#xFF0C;&#x4E5F;&#x6709;&#x636E;&#x53EF;&#x5FAA;&#xFF0C;&#x53EF;&#x4EE5;&#x544A;&#x90A3;&#x5BB6;&#x996D;&#x5E97;&#x3002; &#x8FD9;&#x662F;&#x56FD;&#x6C11;&#x6CD5;&#x5F8B;&#x610F;&#x8BC6;&#x666E;&#x904D;&#x63D0;&#x5347;&#x7684;&#x8868;&#x73B0;&#x5440;&#xFF01; &lt;a href="http://zhi.hu/Ja53"&gt;http://zhi.hu/Ja53&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;

&lt;p&gt;&#x4E4B;&#x524D;&#x6709;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x662F;&#x5728;&#x516C;&#x8F66;&#x4E0A;&#x9605;&#x8BFB;&#x4E00;&#x4E9B;&#x7535;&#x5B50;&#x4E66;&#xFF0C;&#x800C;&#x4E0D;&#x662F; google reader&#x3002;&#x540E;&#x6765;&#x6211;&#x53D1;&#x89C9;&#xFF0C;&#x5728;&#x516C;&#x8F66;&#x4E0A;&#x5F88;&#x96BE;&#x505A;&#x8FD9;&#x4E9B;&#x6301;&#x7EED;&#x4E13;&#x6CE8;&#x7684;&#x9605;&#x8BFB;&#xFF0C;&#x800C;&#x4E14;&#x7528;&#x624B;&#x673A;&#x662F;&#x771F;&#x7684;&#x5F88;&#x4F24;&#x773C;&#x775B;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x6709;&#x6548;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x6211;&#x4E13;&#x6CE8;&#x8FC7;&#x5916;&#x6587;&#x9605;&#x8BFB;&#xFF0C;&#x7528;&lt;a href="https://play.google.com/store/apps/details?id=info.dourok.dict.shanbay" title=""&gt;&#x6247;&#x8D1D;&#x67E5;&#x8BCD;&lt;/a&gt;&#x8BB0;&#x5355;&#x8BCD;&#x5F88;&#x65B9;&#x4FBF;&#x3002;&#x6240;&#x4EE5;&#x50CF;&#x662F;&#x300A;&#x82CF;&#x83F2;&#x7684;&#x4E16;&#x754C;&#x300B;&#x90A3;&#x6837;&#x7684;&#x5916;&#x6587;&#x8FD8;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x3002;&#x4E5F;&#x8BFB;&#x8FC7;&#x300A;effective java&#x300B;&#xFF0C;&#x6548;&#x679C;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x6BCF;&#x5F53;&#x6709;&#x6240;&#x6536;&#x83B7;&#xFF0C;&#x8981;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x5C31;&#x5F88;&#x9EBB;&#x70E6;&#x3002;&#x5728;&#x516C;&#x8F66;&#x4E0A;&#x6253;&#x5F00; evernote &#xFF0C;&#x5373;&#x4FBF;&#x662F;&#x5168;&#x952E;&#x76D8;&#x7684;&#x624B;&#x673A;&#x6253;&#x5B57;&#x4E5F;&#x4E0D;&#x8212;&#x670D;&#x3002;&#x53E6;&#x5916;&#x50CF;&#x662F;GEB&#x8FD9;&#x6837;&#x7684;&#x4E66;&#x5219;&#x5B8C;&#x5168;&#x8BFB;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x4E00;&#x4E9B;&#x4E66;&#x5012;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x6BD4;&#x5982;&#x300A;&#x4E09;&#x4F53;&#x300B;&#x3001;&#x300A;&#x6D6A;&#x6F6E;&#x4E4B;&#x5DC5;&#x300B;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x516C;&#x8F66;&#x770B;&#x4E86;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5176;&#x5B9E;&#xFF0C;google reader &#x4E5F;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x5BF9;&#x9605;&#x8BFB;&#x6761;&#x4EF6;&#x6298;&#x8877;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x5B83;&#x8BFB;&#x8D77;&#x6765;&#x771F;&#x7684;&#x5F88;&#x8212;&#x670D;&#xFF0C;&#x5927;&#x91CF;&#x6311;&#x9009;&#x8FC7;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x591A;&#x90FD;&#x662F;&#x65E0;&#x9700;&#x601D;&#x8003;&#x7684;&#xFF0C;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x9677;&#x8FDB;&#x53BB;&#x7684;&#x8212;&#x9002;&#x533A;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6240;&#x4EE5;&#x5BA3;&#x6CC4;&#x8FC7;&#x540E;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x5012;&#x53EF;&#x4EE5;&#x63A5;&#x53D7; Google Reader &#x7684;&#x5173;&#x95ED;&#x3002;&#x6D41;&#x6C34;&#x4E0D;&#x8150;&#xFF0C;&#x5B83;&#x65E9;&#x5C31;&#x4E0D;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x6539;&#x53D8;&#x5374;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x75DB;&#x82E6;&#x603B;&#x8981;&#x9762;&#x5BF9;&#xFF0C;&#x53EA;&#x662F;&#x8FDF;&#x65E9;&#x7684;&#x95EE;&#x9898;&#x3002;Reader &#x7684;&#x5173;&#x95ED;&#xFF0C;&#x6B63;&#x597D;&#x51CF;&#x5C11;&#x5BF9; RSS &#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x8003;&#x8651;&#x63A5;&#x4E0B;&#x6765;&#x5165;&#x624B; Kindle &#x4E13;&#x6CE8;&#x4E8E;&#x770B;&#x4E66;&#xFF0C;&#x8FD8;&#x662F;&#x5E73;&#x677F;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x516C;&#x5F00;&#x8BFE;&#x3002;&#x5F53;&#x7136;&#x535A;&#x5BA2;&#x8FD8;&#x662F;&#x8981;&#x770B;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x5199;&#x7684;&#x3002;&#x53EA;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x8981;&#x91CD;&#x5EFA;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x65B9;&#x5F0F;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x56DE;&#x5230;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x5176;&#x5B9E;&#x5BF9;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x60F3;&#x5199;&#x7684;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x618B;&#x5230;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x65E0;&#x8BDD;&#x53EF;&#x8BF4;&#x4E86;&#x3002;&#x7B80;&#x5355;&#x8BF4;&#x8BF4;&#xFF0C;&#x6211;&#x628A;&#x4E2A;&#x4EBA;&#x7684;&#x5199;&#x4F5C;&#x5185;&#x5BB9;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x5C42;&#x6B21;&#xFF0C;&#x535A;&#x5BA2;&#xFF0C;&#x7B14;&#x8BB0;&#xFF0C;&#x65E5;&#x8BB0;&#x3002;&#x535A;&#x5BA2;&#x662F;&#x4E00;&#x4E2A;&#x5C55;&#x793A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x653E;&#x4E00;&#x4E9B;&#x6211;&#x5E0C;&#x671B;&#x4E0E;&#x522B;&#x4EBA;&#x5206;&#x4EAB;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7B14;&#x8BB0;&#x5219;&#x53EF;&#x4EE5;&#x7B97;&#x662F;&#x534A;&#x516C;&#x5F00;&#x7684;&#x7CFB;&#x7EDF;&#xFF08;&#x867D;&#x7136;&#x5185;&#x5BB9;&#x662F;&#x5B8C;&#x5168;&#x516C;&#x5F00;&#x7684;&#xFF09;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x7B14;&#x8BB0;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7410;&#x788E;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x76F8;&#x6BD4;&#x4E00;&#x822C;&#x7B14;&#x8BB0;&#x8BB0;&#x5F55;&#x7684;&#x65B9;&#x4FBF;&#xFF0C;&#x5B83;&#x66F4;&#x591A;&#x662F;&#x8D77;&#x5230;&#x4E00;&#x4E2A;&#x5F52;&#x6863;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5F53;&#x7136;&#x5FEB;&#x901F;&#x8BB0;&#x5F55;&#x4ECD;&#x662F;&#x5B83;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x3002;&#x81F3;&#x4E8E;&#x65E5;&#x8BB0;&#xFF0C;&#x5927;&#x591A;&#x662F;&#x65E0;&#x75C5;&#x547B;&#x541F;&#xFF0C;&#x4E0D;&#x8DB3;&#x4E3A;&#x5916;&#x4EBA;&#x9053;&#x4E5F;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#x4E86;&#x6015;&#x618B;&#x4E0D;&#x4F4F;&#x5728;&#x535A;&#x5BA2;&#x4E0A;&#x653E;&#x4E0A;&#x6742;&#x4E03;&#x6742;&#x516B;&#x7684;&#x6280;&#x672F;&#x7B14;&#x8BB0;&#x7684;&#x987E;&#x8651;&#xFF0C;&#x5728;&#x7B14;&#x8BB0;&#x4E0A;&#x6211;&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x8BB0;&#x5F55;&#xFF0C;&#x4E0D;&#x5FC5;&#x987E;&#x53CA;&#x522B;&#x4EBA;&#x7684;&#x9605;&#x8BFB;&#x611F;&#x53D7;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x4E86;&#x66F4;&#x7EDF;&#x4E00;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x53BB;&#x5F52;&#x6863;&#x7B14;&#x8BB0;&#xFF0C;&#x8FD8;&#x6709; jekyll &#x98CE;&#x683C;&#x7684;&#x5199;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x597D;&#x5427;&#xFF0C;&#x6211;&#x629B;&#x5F03;&#x4E86; dokuwiki&#xFF09;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4F46;&#x662F;&#x8981;&#x5199;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#x8FD8;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x56DE;&#x5934;&#x770B;&#x770B;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x6216;&#x6D45;&#x8584;&#x5730;&#x590D;&#x8FF0;&#x522B;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x6216;&#x7A7A;&#x6D1E;&#x7684;&#x611F;&#x6168;&#x4E0E;&#x6292;&#x6000;&#xFF0C;&#x4E86;&#x89E3;&#x4E0D;&#x591A;&#x5374;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x53BB;&#x5356;&#x5F04;&#x81EA;&#x5DF1;&#x4EC5;&#x77E5;&#x7684;&#x90A3;&#x70B9;&#x4E1C;&#x897F;&#x3002;&#x5199;&#x5230;&#x8FD9;&#x751A;&#x81F3;&#x6709;&#x60F3;&#x5220;&#x9664;&#x6574;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x4F46;&#x6211;&#x7EC8;&#x7A76;&#x6CA1;&#x5220;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x79BB;&#x6211;&#x6240;&#x8BA4;&#x4E3A;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#x8FD8;&#x6709;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x8DDD;&#x79BB;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x5BBD;&#x5BB9;&#x4E00;&#x70B9;&#x3002;&#x53EA;&#x662F;&#x5076;&#x5C14;&#x770B;&#x4E00;&#x4E0B;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;&#x4F1A;&#x89C9;&#x5F97;&#x5F88;&#x65E0;&#x5948;&#xFF0C;&#x5F88;&#x5C11;&#x4EBA;&#x770B;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x53CD;&#x9988;&#xFF0C;&#x611F;&#x89C9;&#x50CF;&#x4E2A;&#x4E8C;&#x8D27;&#x5728;&#x81EA;&#x8A00;&#x81EA;&#x8BED;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6709;&#x65F6;&#x6211;&#x4E5F;&#x4F1A;&#x5728;&#x7F51;&#x4E0A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x65E0;&#x540D;&#x535A;&#x5BA2;&#xFF0C;&#x5F7C;&#x6B64;&#x6563;&#x843D;&#x5404;&#x5730;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8FC7;&#x4EA4;&#x6D41;&#xFF0C;&#x8BFB;&#x8FC7;&#x51E0;&#x7BC7;&#x6587;&#x7AE0;&#x89C9;&#x5F97;&#x6709;&#x8DA3;&#x4FBF;&#x6084;&#x6084;&#x8BA2;&#x9605;&#xFF0C;&#x50CF;&#x5728;&#x6C99;&#x6EE9;&#x4E0A;&#x6316;&#x5230;&#x4E00;&#x53EA;&#x8EB2;&#x8D77;&#x6765;&#x7684;&#x5BC4;&#x5C45;&#x87F9;&#xFF0C;&#x6709;&#x70B9;&#x5C0F;&#x5C0F;&#x7684;&#x6B23;&#x559C;&#x3002;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x4FDD;&#x6301;&#x5199;&#x4F5C;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x4EA4;&#x7ED9;&#x65F6;&#x95F4;&#x3002;&lt;/p&gt;
</description>
    </item>
    <item>
      <title>Life Doesn't Make Sense</title>
      <link>https://douo.github.io/moon-2013//2012/12/06/life-doesn-t-make-sense</link>
      <pubDate>2012-12-06</pubDate>
      <description>&lt;p&gt;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#xFF0C;&#x9053;&#x4E0D;&#x51FA;&#x5FC3;&#x5883;&#x5982;&#x4F55;&#x3002;&#x7EB3;&#x5170;&#x4E00;&#x9996;&#x8BCD;&#x5012;&#x53EF;&#x7B97;&#x4F5C;&#x4E00;&#x79CD;&#x9690;&#x6666;&#x7684;&#x5199;&#x7167;&lt;/p&gt;

&lt;blockquote&gt;
&lt;p&gt;&#x8C01;&#x7FFB;&#x4E50;&#x5E9C;&#x51C4;&#x51C9;&#x66F2;&#xFF0C;&#x98CE;&#x4E5F;&#x8427;&#x8427;&#xFF0C;&#x96E8;&#x4E5F;&#x8427;&#x8427;&#x3002;&#x7626;&#x5C3D;&#x706F;&#x82B1;&#x53C8;&#x4E00;&#x5BB5;&#x3002; &lt;/p&gt;

&lt;p&gt;&#x4E0D;&#x77E5;&#x4F55;&#x4E8B;&#x8426;&#x6000;&#x62B1;&#xFF0C;&#x9192;&#x4E5F;&#x65E0;&#x804A;&#xFF0C;&#x9189;&#x4E5F;&#x65E0;&#x804A;&#xFF0C;&#x68A6;&#x4E5F;&#x4F55;&#x66FE;&#x5230;&#x8C22;&#x6865;&#x3002;&lt;/p&gt;
&lt;/blockquote&gt;

&lt;p&gt;&#x6628;&#x591C;&#xFF0C;&#x4E24;&#x90E8;&#x8759;&#x8760;&#x4FA0;&#x770B;&#x5230;&#x51CC;&#x6668;3&#x70B9;&#xFF0C;&#x4ECA;&#x65E5;&#x4E2D;&#x5348;&#x9192;&#x6765;&#xFF0C;&#x4E0B;&#x5348;&#x4E5F;&#x662F;&#x7CBE;&#x795E;&#x840E;&#x9761;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x8352;&#x5E9F;&#x65F6;&#x95F4;&#xFF0C;&#x53C8;&#x73A9;&#x4E86;DOTA&#x3002;&#x5230;&#x4E86;&#x6B64;&#x523B;&#x624D;&#x60CA;&#x9192;&#xFF0C;&#x80FD;&#x9759;&#x4E0B;&#x6765;&#x5F00;&#x59CB;&#x53CD;&#x601D;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x5E74;&#x5C81;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E3A;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x9677;&#x5165;&#x61CA;&#x607C;&#x800C;&#x4E0D;&#x80FD;&#x81EA;&#x62D4;&#xFF0C;&#x53EA;&#x662F;&#x5947;&#x602A;&#x9053;&#x7406;&#x90FD;&#x61C2;&#xFF0C;&#x53EF;&#x8FD8;&#x662F;&#x4E0D;&#x80FD;&#x81EA;&#x63A7;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x5F52;&#x7ED3;&#x4E8E;&#x62D6;&#x5EF6;&#x75C7;&#x5427;&#x3002;&#x4E5F;&#x8BB8;&#x5C31;&#x662F;&#x62D6;&#x5EF6;&#x75C7;&#xFF0C;&#x4F46;&#x5176;&#x6839;&#x6E90;&#x4E5F;&#x503C;&#x5F97;&#x5206;&#x6790;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4EBA;&#x751F;&#x4E4B;&#x76EE;&#x6807;&#xFF0C;&#x4E0D;&#x77E5;&#x8BE5;&#x5982;&#x4F55;&#x8BF4;&#x3002;&#x5982;&#x679C;&#x771F;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x80FD;&#x4E00;&#x76F4;&#x7167;&#x7740;&#x8D70;&#xFF0C;&#x90A3;&#x771F;&#x662F;&#x65E0;&#x4E0A;&#x7684;&#x5E78;&#x798F;&#x3002;&#x53EA;&#x662F;&#x8FD9;&#x4E16;&#x95F4;&#x7684;&#x7F8E;&#x662F;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x600E;&#x4E48;&#x820D;&#x5F97;&#x653E;&#x5F03;&#x3002;&#x4E4B;&#x524D;&#x7684;&#x6211;&#x4E5F;&#x4ECE;&#x672A;&#x505A;&#x4E0D;&#x5230;&#xFF0C;&#x53EA;&#x662F;&#x8FF7;&#x4FE1;&#x8D70;&#x5230;&#x90A3;&#x91CC;&#x4E86;&#xFF0C;&#x5176;&#x5B83;&#x4E00;&#x5207;&#x90FD;&#x4F1A;&#x968F;&#x7740;&#x800C;&#x6765;&#x3002;&#x4EE5;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x5929;&#x771F;&#x7684;&#x53EF;&#x7B11;&#xFF0C;&#x8FD9;&#x4E16;&#x95F4;&#x4E8B;&#x600E;&#x4E48;&#x4F1A;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x53EF;&#x60B2;&#x7684;&#x662F;&#x73B0;&#x5728;&#x7684;&#x81EA;&#x5DF1;&#x4E5F;&#x9003;&#x4E0D;&#x51FA;&#x8FD9;&#x5929;&#x771F;&#xFF0C;&#x53EA;&#x662F;&#x7531;&#x57CB;&#x5934;&#x7684;&#x9E35;&#x9E1F;&#xFF0C;&#x53D8;&#x6210;&#x4E95;&#x5E95;&#x7684;&#x9752;&#x86D9;&#x3002;&#x4EE5;&#x524D;&#x4EC0;&#x4E48;&#x4E5F;&#x770B;&#x4E0D;&#x89C1;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x770B;&#x5230;&#x4E00;&#x7247;&#x5C0F;&#x5C0F;&#x7684;&#x5929;&#xFF0C;&#x56F0;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4E0D;&#x80FD;&#x81EA;&#x62D4;&#x3002;&#x6211;&#x628A;&#x672A;&#x6765;&#x538B;&#x5728;&#x529F;&#x6210;&#x540D;&#x5C31;&#x4E0A;&#xFF0C;&#x5929;&#x9A6C;&#x884C;&#x7A7A;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6CA1;&#x6709;&#x6839;&#x57FA;&#x5C31;&#x89C4;&#x5212;&#x51FA;&#x5404;&#x79CD;&#x7F8E;&#x597D;&#x7684;&#x524D;&#x666F;&#xFF0C;&#x8FDE;&#x81EA;&#x5DF1;&#x4E5F;&#x4E0D;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x4F1A;&#x505A;&#x5230;&#xFF0C;&#x53EA;&#x80FD;&#x62D6;&#x5EF6;&#x3001;&#x62D6;&#x5EF6;&#xFF0C;&#x4E0D;&#x65AD;&#x628A;&#x5931;&#x8D25;&#x5EF6;&#x540E;&#x3002;&#x4F55;&#x51B5;&#x94BB;&#x8425;&#x4EC0;&#x4E48;&#x529F;&#x6210;&#x540D;&#x5C31;&#x7684;&#x5927;&#x68A6;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x672C;&#x5FC3;&#xFF0C;&#x771F;&#x6B63;&#x61A7;&#x61AC;&#x7684;&#x662F;&#x8FD8;&#x662F;&#x4E24;&#x4E2A;&#x4EBA;&#x7B80;&#x5355;&#x7684;&#x5C0F;&#x751F;&#x6D3B;&#xFF0C;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x79D1;&#x5B66;&#x548C;&#x7A0B;&#x5E8F;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#x7F8E;&#xFF0C;&#x601D;&#x8003;&#x5E26;&#x6765;&#x7684;&#x987F;&#x609F;&#x3002;&#x53EA;&#x662F;&#x73B0;&#x5728;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x79CD;&#x5C0F;&#x751F;&#x6D3B;&#x6BD4;&#x8D77;&#x90A3;&#x4E9B;&#x5927;&#x8FFD;&#x6C42;&#x8FD8;&#x8981;&#x66F4;&#x98D8;&#x6E3A;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x591A;&#x4E48;&#x53EF;&#x60B2;&#xFF0C;&#x751F;&#x6D3B;&#x603B;&#x663E;&#x5F97;&#x90A3;&#x4E48;&#x7684;&#x7A7A;&#x865A;&#xFF0C;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x7A7A;&#x6D1E;&#xFF0C;&#x53EA;&#x80FD;&#x7528;&#x5404;&#x79CD;&#x8FFD;&#x6C42;&#x6765;&#x586B;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x6211;&#x57F9;&#x517B;&#x51FA;&#x5F88;&#x591A;&#x65E0;&#x8C13;&#x7684;&#x7231;&#x597D;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x5305;&#x62EC;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x53EF;&#x4E0D;&#x65AD;&#x7684;&#x586B;&#x5374;&#x8FD8;&#x662F;&#x90A3;&#x4E48;&#x7A7A;&#x3002;&#x4EBA;&#x53D8;&#x5F97;&#x6D6E;&#x8E81;&#x51B2;&#x52A8;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x52C7;&#x6C14;&#x8D8A;&#x8FC7;&#x90A3;&#x6761;&#x7EBF;&#xFF0C;&#x800C;&#x4E14;&#x6162;&#x6162;&#x66F4;&#x53D8;&#x5F97;&#x61E6;&#x5F31;&#xFF0C;&#x6240;&#x8C13;&#x5174;&#x8DA3;&#xFF0C;&#x9664;&#x4E86;&#x4EE3;&#x7801;&#x8FD8;&#x80FD;&#x6362;&#x94B1;&#xFF0C;&#x5176;&#x5B83;&#x90FD;&#x662F;&#x6700;&#x4E0D;&#x53D7;&#x5F85;&#x89C1;&#x7684;&#x3002;&#x53EA;&#x662F;&#x6C89;&#x6D78;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5C0F;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x5F88;&#x6709;&#x60C5;&#x8C03;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x88C5;&#x5427;&#x3002;&#x53EF;&#x7B11;&#x7684;&#x662F;&#x5E38;&#x5E38;&#x6DF1;&#x9677;&#x800C;&#x4E0D;&#x81EA;&#x77E5;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6BCF;&#x65E5;&#x7410;&#x4E8B;&#x70E6;&#x591A;&#xFF0C;&#x8FD8;&#x5F97;&#x9A97;&#x81EA;&#x5DF1;&#xFF0C;&#x505A;&#x5F97;&#x90FD;&#x662F;&#x4E9B;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x3002;&#x51B7;&#x9759;&#x4E00;&#x60F3;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x4E0E;&#x6211;&#x6240;&#x671F;&#x5F85;&#x7684;&#x751F;&#x6D3B;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x6216;&#x5982;&#x5DF4;&#x897F;&#x4E4B;&#x8774;&#x8776;&#x540C;&#x7F8E;&#x56FD;&#x4E4B;&#x98D3;&#x98CE;&#x4E00;&#x822C;&#x5427;&#x3002;&#x4E00;&#x65E6;&#x6000;&#x7591;&#x4E86;&#xFF0C;&#x60C5;&#x7EEA;&#x4F4E;&#x843D;&#x4E86;&#xFF0C;&#x8FD8;&#x5F97;&#x53BB;&#x627E;&#x4E00;&#x4E9B;&#x6FC0;&#x52B1;&#x7684;&#x8BDD;&#x8BED;&#xFF0C;&#x6765;&#x9A97;&#x81EA;&#x5DF1;&#xFF0C;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x7CBE;&#x795E;&#x604D;&#x60DA;&#xFF0C;&#x4E0D;&#x77E5;&#x6240;&#x8A00;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x62D6;&#x5EF6;&#x75C7;&#x90A3;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x4F9D;&#x7A00;&#x6709;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x505A;&#x4E0D;&#x5230;&#x6539;&#x53D8;&#xFF0C;&#x90A3;&#x5C31;&#x63A5;&#x53D7;&#x81EA;&#x5DF1;&#x3002;&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x4E3A; Ruhoh &#x751F;&#x6210;&#x6587;&#x7AE0;&#x76EE;&#x5F55;</title>
      <link>https://douo.github.io/moon-2013//2012/11/20/generating-a-toc-in-ruhoh</link>
      <pubDate>2012-11-20</pubDate>
      <description>&lt;p&gt;&#x4E3A;&#x6587;&#x7AE0;&#x751F;&#x6210;&#x76EE;&#x5F55;&#xFF0C;&#x5373;&#x6240;&#x8C13;&#x7684; TOC&#xFF08;Table of Contents&#xFF09;&#xFF0C; &#x53EF;&#x4EE5;&#x5728;&#x524D;&#x53F0;&#x6216;&#x540E;&#x53F0;&#x5B9E;&#x73B0;&#x3002;&#x663E;&#x7136;&#x5728;&#x524D;&#x53F0;&#xFF0C;&#x5373;&#x7528; javascript &#x5B9E;&#x65F6;&#x751F;&#x6210;&#x76EE;&#x5F55;&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x800C;&#x4E14; &lt;a href="https://twitter.com/#!/brianclapper" title=""&gt;@brianclapper&lt;/a&gt; &#x65E9;&#x5DF2;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5728; Octopress &#x4E0A;&#x5B9E;&#x73B0;&#x7684;&lt;a href="http://brizzled.clapper.org/blog/2012/02/04/generating-a-table-of-contents-in-octopress/" title=""&gt;&#x65B9;&#x6CD5;&lt;/a&gt;&#xFF0C;&#x5728; ruhoh &#x4E0A;&#x53EF;&#x4EE5;&#x7528; widgets &#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x5B9E;&#x73B0;&#x6839;&#x636E; page &#x53C2;&#x6570;&#x6765;&#x5F00;&#x542F;&#x5173;&#x95ED;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728; ruhoh &#x7684; widgets &#x4E0D;&#x80FD;&#x8BFB;&#x53D6;&#x5230; page &#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E5F;&#x53EA;&#x662F;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x662F;&#x6211;&#x9009;&#x62E9;&#x540E;&#x53F0;&#x5B9E;&#x73B0;&#x7684;&#x539F;&#x56E0;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E3A;&#x4F55;&#x8981;&#x5728;&#x540E;&#x53F0;&#x751F;&#x6210;&#x76EE;&#x5F55;&#xFF1F;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x76EE;&#x5F55;&#x5E94;&#x8BE5;&#x548C;&#x6B63;&#x6587;&#x4E00;&#x6837;&#x662F;&#x5C5E;&#x4E8E;&#x6587;&#x7AE0;&#x7684;&#x4E00;&#x90E8;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x9700;&#x8981;&#x4E00;&#x4E2A; javascript &#x89E3;&#x6790;&#x5668;&#x624D;&#x80FD;&#x628A;&#x6587;&#x7AE0;&#x663E;&#x793A;&#x5B8C;&#x6574;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x652F;&#x6301;&#x4E09;&#x79CD;&#x5F00;&#x542F;&#x76EE;&#x5F55;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x81EA;&#x52A8;&#xFF0C;&#x5F3A;&#x5236;&#x5F00;&#x542F;&#xFF0C;&#x5F3A;&#x5236;&#x5173;&#x95ED;&#xFF0C;&#x540E;&#x6765;&#x89C9;&#x5F97;&#x53EA;&#x6709;&#x6807;&#x9898;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x6570;&#x91CF;&#x624D;&#x751F;&#x6210;&#x76EE;&#x5F55;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x81EA;&#x52A8;&#x8FD9;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x5C31;&#x5DF2;&#x8DB3;&#x591F;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#x6211;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x597D;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#xFF0C;&#x7528;&#x63D2;&#x4EF6;&#x5B9E;&#x73B0;&#x7F16;&#x8BD1;&#x4E00;&#x6B21;&#x641E;&#x5B9A;&#xFF0C;&#x4E0D;&#x7528;&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;&#x90FD;&#x6D6A;&#x8D39;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x53BB;&#x751F;&#x6210;&#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x4E5F;&#x7B97;&#x662F;&#x4F18;&#x70B9;&#x4E4B;&#x4E00;&#x5427;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E00;&#x5F00;&#x59CB;&#x6CA1;&#x60F3;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x76F4;&#x63A5;&#x7528; Markdown Converter &#x6765;&#x751F;&#x6210;&#x76EE;&#x5F55;&#xFF0C;&#x628A;&#x76EE;&#x5F55;&#x4EE3;&#x7801;&#x76F4;&#x63A5;&#x52A0;&#x5165;&#x5230; Markdown &#x8F6C;&#x6362;&#x540E;&#x7684;&#x6700;&#x7EC8;&#x6587;&#x6863;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x6709;&#x5F88;&#x5927;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x76EE;&#x5F55;&#x4E0D;&#x80FD;&#x4E0E;&#x6587;&#x7AE0;&#x5185;&#x5BB9;&#x5206;&#x79BB;&#x51FA;&#x6765;&#x653E;&#x5728;&#x9875;&#x9762;&#x7684;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#xFF0C;&#x6BEB;&#x65E0;&#x7075;&#x6D3B;&#x6027;&#x53EF;&#x8A00;&#x3002;&#x7406;&#x60F3;&#x4E2D;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x7528;&lt;code&gt;{{page.toc}}&lt;/code&gt;&#x5728;&#x6A21;&#x677F;&#x4E2D;&#x6307;&#x5B9A;&#x76EE;&#x5F55;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x901A;&#x8FC7; partial &#x6765;&#x5B9A;&#x5236; toc &#x7684;&#x6A21;&#x677F;&#xFF0C;&#x540E;&#x6765;&#x505A;&#x4E86;&#x7B14;&#x8BB0;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x98CE;&#x683C;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x66F4;&#x4E0D;&#x80FD;&#x56DE;&#x907F;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E3A;&#x4E86;&#x901A;&#x8FC7; mustache &#x6807;&#x7B7E;&#x6765;&#x8F7D;&#x5165; TOC&#xFF0C;&#x5C31;&#x5F97;&#x727A;&#x7272;&#x4E00;&#x4E0B;&#x6548;&#x7387;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A; ruhoh &#x7684;&#x7F16;&#x8BD1;&#x6D41;&#x7A0B;&#x6240;&#x9650;&#xFF0C;&#x4E0D;&#x80FD;&#x505A;&#x5230;&#x5C06; Converter &#x5DE5;&#x4F5C;&#x540E;&#x7684;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E3A; Mustache &#x89E3;&#x6790;&#x5668;&#x6240;&#x7528;&#x3002;&#x8FD9;&#x6837;&#x8868;&#x8FBE;&#x597D;&#x50CF;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x56E0;&#x4E3A;&#x76EE;&#x5F55;&#x7684;&#x6570;&#x636E;&#x662F;&#x9700;&#x8981; Markdown Converter &#x6765;&#x751F;&#x6210;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x5C06; markdown &#x8F6C;&#x6362;&#x4E3A; html &#x540E;&#xFF0C;&#x624D;&#x77E5;&#x9053;&#x76EE;&#x5F55;&#x662F;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x5728; mustache &#x7684; render &#x65B9;&#x6CD5;&#x91CC;&#xFF0C;&#x6240;&#x4EE5; mustache &#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x5230; Converter &#x91CC;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E8E;&#x662F;&#x5F53;&#x6A21;&#x677F;&#x9700;&#x8981;&#x76EE;&#x5F55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x80FD;&#x518D;&#x53BB;&#x89E3;&#x6790;&#x4E00;&#x904D; Markdown &#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x662F;&#x8BF4;&#x4E00;&#x4E2A; Markdown &#x6587;&#x4EF6;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x4E24;&#x6B21;&#x89E3;&#x6790;&#x624D;&#x80FD;&#x751F;&#x6210;&#x76EE;&#x6807;&#x9875;&#x9762;&#xFF0C;&#x4E0D;&#x8FC7;&#x76EE;&#x524D;&#x6548;&#x7387;&#x8FD8;&#x8FDC;&#x8FDC;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5B9E;&#x73B0;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x4EE3;&#x7801;&#x89C1; &lt;a href="https://github.com/douo/douo.ruhoh.com/blob/master/plugins/toc_render.rb" title=""&gt;toc_render.rb&lt;/a&gt; &#x548C; &lt;a href="https://github.com/douo/douo.ruhoh.com/blob/master/plugins/custom.rb" title=""&gt;custom.rb&lt;/a&gt;&#xFF0C;&lt;a href="https://github.com/douo/douo.ruhoh.com/blob/master/plugins/toc_render.rb" title=""&gt;toc_render.rb&lt;/a&gt; &#x662F;&#x751F;&#x6210; TOC &#x7684; Markdown &#x89E3;&#x6790;&#x5668;&#xFF0C;&lt;a href="https://github.com/douo/douo.ruhoh.com/blob/master/plugins/custom.rb" title=""&gt;custom.rb&lt;/a&gt; &#x5B9A;&#x4E49;&#x4E86; mustache helper &lt;code&gt;{{page.toc}}&lt;/code&gt;&#x3002;&#x53E6;&#x5916;&#x8FD8;&#x6709; &lt;a href="https://github.com/douo/douo.ruhoh.com/blob/master/plugins/converters/limdown.rb" title=""&gt;limdown.rb&lt;/a&gt;&#xFF0C;&#x662F;&#x751F;&#x6210;&#x9875;&#x9762;&#x6700;&#x7EC8;&#x6548;&#x679C;&#x7684; Markdown Converter&#xFF0C;&#x5B83;&#x4E3A;&#x6BCF;&#x4E2A; header &#x52A0;&#x4E0A; id&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4EE5;&#x6587;&#x7AE0;&lt;a href="/2012/08/20/something-about-ruhoh" title=""&gt;Ruhoh &#x672D;&#x8BB0;&lt;/a&gt;&#x4E3A;&#x4F8B;&#xFF0C;&#x5B83;&#x7684;&#x76EE;&#x5F55;&#x6570;&#x636E;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&lt;/p&gt;
&lt;pre&gt;&lt;code class="ruby"&gt;{:level=&amp;gt;0,
 :children=&amp;gt;
  [{:text=&amp;gt;&amp;quot;ruhoh&amp;quot;, :level=&amp;gt;3, :count=&amp;gt;0, :anchor=&amp;gt;&amp;quot;toc_0&amp;quot;, :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;&#x8BC4;&#x8BBA;&amp;quot;, :level=&amp;gt;3, :count=&amp;gt;1, :anchor=&amp;gt;&amp;quot;toc_1&amp;quot;, :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;&#x4E3B;&#x9898;&amp;quot;, :level=&amp;gt;3, :count=&amp;gt;2, :anchor=&amp;gt;&amp;quot;toc_2&amp;quot;, :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;mustache&amp;quot;, :level=&amp;gt;3, :count=&amp;gt;3, :anchor=&amp;gt;&amp;quot;toc_3&amp;quot;, :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;Markdown&amp;quot;, :level=&amp;gt;3, :count=&amp;gt;4, :anchor=&amp;gt;&amp;quot;toc_4&amp;quot;, :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;RSS &amp;amp;amp; Sitemap&amp;quot;,
    :level=&amp;gt;3,
    :count=&amp;gt;5,
    :anchor=&amp;gt;&amp;quot;toc_5&amp;quot;,
    :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;&#x642C;&#x5BB6;&amp;quot;, :level=&amp;gt;3, :count=&amp;gt;6, :anchor=&amp;gt;&amp;quot;toc_6&amp;quot;, :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;&#x90E8;&#x7F72;&amp;quot;, :level=&amp;gt;3, :count=&amp;gt;7, :anchor=&amp;gt;&amp;quot;toc_7&amp;quot;, :children=&amp;gt;[]},
   {:text=&amp;gt;&amp;quot;&#x5176;&#x4ED6;&amp;quot;,
    :level=&amp;gt;3,
    :count=&amp;gt;8,
    :anchor=&amp;gt;&amp;quot;toc_8&amp;quot;,
    :children=&amp;gt;
     [{:text=&amp;gt;&amp;quot;Mathjax&amp;quot;,
       :level=&amp;gt;4,
       :count=&amp;gt;9,
       :anchor=&amp;gt;&amp;quot;toc_9&amp;quot;,
       :children=&amp;gt;[]},
      {:text=&amp;gt;&amp;quot;&#x81EA;&#x52A8;&#x5237;&#x65B0;&amp;quot;, :level=&amp;gt;4, :count=&amp;gt;10, :anchor=&amp;gt;&amp;quot;toc_10&amp;quot;, :children=&amp;gt;[]},
      {:text=&amp;gt;&amp;quot;TODO&amp;quot;,
       :level=&amp;gt;4,
       :count=&amp;gt;11,
       :anchor=&amp;gt;&amp;quot;toc_11&amp;quot;,
       :children=&amp;gt;[]}]}]}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6811;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x7ED3;&#x6784;&#xFF0C;&#x5728; Mustache &#x4E2D;&#x9700;&#x8981;&#x9012;&#x5F52;&#x8F7D;&#x5165; partial &#x6765;&#x80FD;&#x8868;&#x73B0;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x6BD4;&#x5982;&#x7B14;&#x8BB0;&#x7CFB;&#x7EDF;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x4E24;&#x4E2A; partial&#x3002;&lt;/p&gt;

&lt;p&gt;note_toc.mustache:&lt;/p&gt;
&lt;pre&gt;&lt;code class="mustache"&gt;{{# page.toc }}
&amp;lt;div class=&amp;quot;span3 toc&amp;quot;&amp;gt;&amp;lt;ol class=&amp;quot;toc-list&amp;quot;&amp;gt;
   {{#children}}
     {{&amp;gt; toc_li}}
   {{/children}}
&amp;lt;/div&amp;gt;
{{/ page.toc}}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;toc_li.mustache:&lt;/p&gt;
&lt;pre&gt;&lt;code class="mustache"&gt;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;#{{anchor}}&amp;quot;&amp;gt;{{{text}}}&amp;lt;/a&amp;gt;
&amp;lt;ul&amp;gt;
   {{#children}}
     {{&amp;gt; toc_li}}
   {{/children}}
&amp;lt;/ul&amp;gt;
&amp;lt;/li&amp;gt;
&lt;/code&gt;&lt;/pre&gt;</description>
    </item>
    <item>
      <title>&#x56E4;&#x4E66;&#x6210;&#x763E;</title>
      <link>https://douo.github.io/moon-2013//2012/11/05/too-many-books-to-read</link>
      <pubDate>2012-11-05</pubDate>
      <description>&lt;p&gt;&#x53C8;&#x5728;&#x4EAC;&#x4E1C;&#x8D25;&#x4E86;300&#x5143;&#x7684;&#x4E66;&#xFF0C;&#x5F53;&#x7136;&#x4E86;&#x5B9E;&#x4ED8;&#x4E00;&#x534A;&#x3002;&#x5982;&#x4ECA;&#x6BCF;&#x6BCF;&#x4E70;&#x4E66;&#x5185;&#x5FC3;&#x5FC5;&#x611F;&#x6127;&#x759A;&#xFF0C;&#x7A76;&#x5176;&#x539F;&#x56E0;&#xFF0C;&#x6B63;&#x5982;&#x8C46;&#x74E3;&#x67D0;&#x8BFB;&#x4E66;&#x5C0F;&#x7EC4;&#x4E4B;&#x540D;&#xFF1A;&lt;strong&gt;&#x4E70;&#x4E66;&#x5982;&#x5C71;&#x5012;&#xFF0C;&#x8BFB;&#x4E66;&#x5982;&#x62BD;&#x4E1D;&lt;/strong&gt;&#x3002;&#x5C31;&#x4ECA;&#x5E74;&#x800C;&#x8A00;&#xFF0C;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x5206;&#x4E86;&#x51E0;&#x6B21;&#xFF0C;&#x4E70;&#x4E86;50&#x6765;&#x672C;&#x4E66;&#xFF0C;&#x89C1;&#x6B64;&lt;a href="http://book.douban.com/doulist/1553961/" title=""&gt;&#x8C46;&#x5217;&lt;/a&gt;&#x3002;&#x867D;&#x8BF4;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x5C11;&#x3002;&#x5C11;&#x5E74;&#x65F6;&#x4EE3;&#x7684;&#x4E66;&#x67B6;&#x65E9;&#x5DF2;&#x652F;&#x6491;&#x4E0D;&#x4E86;&#x8FD9;&#x4E9B;&#x4E66;&#xFF0C;&#x53EA;&#x80FD;&#x4EFB;&#x51ED;&#x5806;&#x79EF;&#x5728;&#x623F;&#x95F4;&#x89D2;&#x843D;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5982;&#x4ECA;2012&#x5DF2;&#x63A5;&#x8FD1;&#x7EC8;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x4E66;&#x5230;&#x5E95;&#x770B;&#x4E86;&#x591A;&#x5C11; &#xFF1F;&#x5176;&#x5B9E;&#x82E5;&#x4EE5;&#x7FFB;&#x9605;&#x8BBA;&#xFF0C;&#x6BCF;&#x672C;&#x4E66;&#x5927;&#x62B5;&#x4E5F;&#x90FD;&#x7FFB;&#x8FC7;&#x3002;&#x82E5;&#x7B97;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x770B;&#x5B8C;&#xFF0C;&#x5219;&#x4FBF;&#x53EA;&#x6709;&#x5BE5;&#x5BE5;&#x6570;&#x672C;&#xFF0C;&#x800C;&#x4E14;&#x90FD;&#x662F;&#x6563;&#x6587;&#xFF0C;&#x968F;&#x7B14;&#xFF0C;&#x4F20;&#x8BB0;&#xFF0C;&#x770B;&#x6211;&lt;a href="http://book.douban.com/doulist/1553961/" title=""&gt;&#x8C46;&#x5217;&lt;/a&gt;&#x4FBF;&#x77E5;&#x91CC;&#x9762;&#x4E13;&#x4E1A;&#x6027;&#x7684;&#x5927;&#x90E8;&#x5934;&#x4E0D;&#x5C11;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E66;&#x5927;&#x591A;&#x53EA;&#x7FFB;&#x7FFB;&#x5E8F;&#x8A00;&#xFF0C;&#x6216;&#x5F00;&#x5934;&#x51E0;&#x9875;&#x4FBF;&#x96BE;&#x4EE5;&#x518D;&#x7EED;&#xFF0C;&#x6BCF;&#x6B21;&#x60F3;&#x770B;&#x4E66;&#x603B;&#x662F;&#x5728;&#x4E66;&#x5806;&#x91CC;&#x968F;&#x624B;&#x4E00;&#x62FF;&#xFF0C;&#x7FFB;&#x4E2A;&#x8FC7;&#x763E;&#xFF0C;&#x653E;&#x4E0B;&#x540E;&#x4E0D;&#x77E5;&#x4E0B;&#x6B21;&#x62FF;&#x8D77;&#x662F;&#x4F55;&#x65F6;&#xFF0C;&#x53EF;&#x60DC;&#x6CA1;&#x6709;&#x9756;&#x7BC0;&#x5148;&#x751F;&#x4E0D;&#x6C42;&#x751A;&#x89E3;&#x7684;&#x6DE1;&#x6CCA;&#xFF0C;&#x6700;&#x540E;&#x53EA;&#x80FD;&#x4E0D;&#x65AD;&#x6094;&#x6068;&#x3002;&#x6211;&#x7684;&#x65F6;&#x95F4;&#x5448;&#x788E;&#x7247;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x65E5;&#x770B;&#x4E66;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x5C11;&#xFF0C;&#x4E0A;&#x73ED;&#x4FBF;&#x8981;&#x5360;&#x636E;&#x6389;&#x4E00;&#x5929;&#x4E2D;&#x7684;&#x9EC4;&#x91D1;12&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5176;&#x4E2D;2&#x4E2A;&#x5C0F;&#x65F6;&#x7981;&#x9522;&#x5728;&#x98A0;&#x7C38;&#x6447;&#x6643;&#x7684;&#x516C;&#x8F66;&#x4E0A;&#xFF0C;&#x4E66;&#x52C9;&#x5F3A;&#x53EF;&#x770B;&#xFF0C;&#x4F46;&#x4E5F;&#x53EA;&#x80FD;&#x662F;&#x5728;&#x6211;3.7&#x5BF8;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x7535;&#x5B50;&#x4E66;&#x3002;&#x56DE;&#x5BB6;&#x540E;&#x53C8;&#x8981;&#x6295;&#x5165;&#x65B0;&#x4E00;&#x8F6E;&#x7684;&#x6298;&#x817E;&#xFF0C;&#x770B;&#x4E66;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x53EA;&#x80FD;&#x6324;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x6B64;&#x770B;&#x6765;&#x770B;&#x53BB;&#x53EA;&#x770B;&#x5B8C;&#x968F;&#x7B14;&#x6563;&#x6587;&#x5C31;&#x4E0D;&#x8DB3;&#x4E3A;&#x602A;&#x4E86;&#xFF0C;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x7CFB;&#x7EDF;&#x5730;&#x770B;&#x4E00;&#x672C;&#x4E66;&#x561B;&#xFF0C;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x51E0;&#x4E2A;&#x6708;&#x751A;&#x81F3;&#x51E0;&#x5E74;&#x6301;&#x7EED;&#x6295;&#x5165;&#x624D;&#x80FD;&#x770B;&#x5B8C;&#x7684;&#x4E66;&#x4E5F;&#x5C31;&#x53EA;&#x80FD;&#x5728;&#x89D2;&#x843D;&#x91CC;&#x8499;&#x5C18;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x518D;&#x8005;&#x5C31;&#x662F;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#x5F15;&#x8D77;&#x7684;&#x62D6;&#x5EF6;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x4E00;&#x672C;&#x4E66;&#x770B;&#x8FC7;&#x540E;&#xFF0C;&#x65F6;&#x5E38;&#x89C9;&#x5F97;&#x5C31;&#x50CF;&#x8FC7;&#x773C;&#x4E91;&#x70DF;&#xFF0C;&#x770B;&#x7684;&#x65F6;&#x5019;&#x9887;&#x6709;&#x89E6;&#x52A8;&#xFF0C;&#x4F46;&#x770B;&#x5B8C;&#x540E;&#x60F3;&#x5199;&#x4EC0;&#x4E48;&#x7ADF;&#x4EC0;&#x4E48;&#x4E5F;&#x5199;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x81EA;&#x6BD4;&#x732A;&#x516B;&#x6212;&#x5403;&#x4EBA;&#x53C2;&#x679C;&#xFF0C;&#x5C1D;&#x4E0D;&#x51FA;&#x6ECB;&#x5473;&#xFF0C;&#x7686;&#x662F;&#x5FEB;&#x3001;&#x6D45;&#x3001;&#x6563;&#x6240;&#x81F4;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x4FBF;&#x60F3;&#x6BCF;&#x672C;&#x4E66;&#x90FD;&#x7559;&#x4E0B;&#x4E2A;&#x8BB0;&#x5F55;&#xFF0C;&#x4EE5;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#x7EC4;&#x7EC7;&#x4E4B;&#x3002;&#x4F46;&#x662F;&#x4E2A;&#x4EBA;&#x5BF9;&#x5DE5;&#x5177;&#x8981;&#x6C42;&#x592A;&#x53FC;&#xFF0C;&#x5DE5;&#x5177;&#x672A;&#x6210;&#x5F62;&#x65F6;&#xFF0C;&#x65E0;&#x6CD5;&#x4E0B;&#x7B14;&#xFF0C;&#x4FBF;&#x8FDE;&#x8BFB;&#x4E66;&#x4E5F;&#x62D6;&#x7D2F;&#x4E86;&#x3002;&#x5982;&#x4ECA;&#x57FA;&#x4E8E; ruhoh &#x5199;&#x4E86;&#x4E2A;&lt;a href="/notes" title=""&gt;&#x7B14;&#x8BB0;&#x7CFB;&#x7EDF;&lt;/a&gt;&#xFF0C;&#x63A5;&#x8FD1;&#x5B8C;&#x6210;&#xFF0C;&#x7528;&#x8D77;&#x6765;&#x9887;&#x4E3A;&#x987A;&#x624B;&#xFF0C;&#x5E0C;&#x671B;&#x6B64;&#x95EE;&#x9898;&#x518D;&#x4E5F;&#x4E0D;&#x4F1A;&#x5A01;&#x80C1;&#x5230;&#x8BFB;&#x4E66;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4ECA;&#x65E5;&#x5C06;&#x4E66;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x756A;&#xFF0C;&#x6309;&#x529F;&#x80FD;&#x5206;&#x53EF;&#x5206;&#x4E3A;&#x5174;&#x8DA3;&#x7C7B;&#x548C;&#x6280;&#x672F;&#x7C7B;&#x4E24;&#x7C7B;&#xFF0C;&#x5174;&#x8DA3;&#x7C7B;&#x6709;&#x8BF8;&#x5BB6;&#x6563;&#x6587;&#x968F;&#x7B14;&#x6742;&#x6587;&#xFF0C;&#x589E;&#x957F;&#x89C1;&#x95FB;&#x548C;&#x62D3;&#x5BBD;&#x77E5;&#x8BC6;&#x9762;&#x7684;&#x5404;&#x7C7B;&#x4E13;&#x8457;&#x3002;&#x6280;&#x672F;&#x7C7B;&#x5219;&#x4E3A;&#x6570;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6280;&#x672F;&#x7C7B;&#x4E66;&#x5927;&#x62B5;&#x539A;&#x5982;&#x7816;&#x5934;&#xFF0C;&#x7528;&#x5C42;&#x6B21;&#x8F83;&#x96BE;&#x533A;&#x5206;&#xFF0C;&#x53EA;&#x80FD;&#x4EE5;&#x8584;&#x539A;&#x5206;&#xFF0C;&#x8584;&#x7684;&#x751A;&#x5C11;&#xFF0C;&#x500D;&#x663E;&#x73CD;&#x8D35;&#xFF0C;&#x6280;&#x672F;&#x6C42;&#x7CBE;&#xFF0C;&#x4E66;&#x6BCF;&#x6B21;&#x53EA;&#x80FD;&#x8BFB;&#x4E00;&#x672C;&#xFF0C;&#x5305;&#x62EC;&#x5927;&#x91CF;&#x7535;&#x5B50;&#x4E66;&#x4E2D;&#x7684;&#x7ECF;&#x5178;&#x3002;&#x4ECE;&#x8584;&#x7684;&#x5F00;&#x59CB;&#x9010;&#x4E2A;&#x51FB;&#x7834;&#x6700;&#x662F;&#x5BB9;&#x6613;&#x3002;&#x800C;&#x4EE5;&#x5174;&#x8DA3;&#x4E3A;&#x76EE;&#x7684;&#x4E66;&#x5927;&#x53EF;&#x5982;&#x4ECE;&#x524D;&#x968F;&#x610F;&#x8BFB;&#x4E4B;&#xFF0C;&#x4E0D;&#x8FC7;&#x4EE5;&#x540E;&#x6BCF;&#x672C;&#x4E66;&#x90FD;&#x8981;&#x5728;&#x6B64;&#x7559;&#x4E0B;&#x75D5;&#x8FF9;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x5F3A;&#x6491;&#x7740;&#x75B2;&#x60EB;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x5199;&#x4E0B;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x7F57;&#x55E6;&#x7684;&#x6587;&#x5B57;&#x3002;&#x53EA;&#x4E3A;&#x77E5;&#x4E4E;&#x4E0A;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&lt;a href="http://www.zhihu.com/question/20508838" title=""&gt;&#x95EE;&#x9898;&lt;/a&gt;&#xFF0C;&#x6B63;&#x597D;&#x6211;&#x4E5F;&#x6709;&#x6B64;&#x56F0;&#x60D1;&#xFF0C;&#x6240;&#x4EE5;&#x542C;&#x4ECE;&#x5EFA;&#x8BAE;&#x3002;&#x65E0;&#x4ED6;&#xFF0C;&#x6253;&#x6253;&#x5B57;&#x7EC3;&#x7EC3;&#x624B;&#x611F;&#x800C;&#x5DF2;&#x3002;&#x5026;&#x610F;&#x5341;&#x8DB3;&#xFF0C;&#x7761;&#x4E86;~&lt;/p&gt;
</description>
    </item>
    <item>
      <title>Ruhoh &#x672D;&#x8BB0;</title>
      <link>https://douo.github.io/moon-2013//2012/08/20/something-about-ruhoh</link>
      <pubDate>2012-08-20</pubDate>
      <description>&lt;h3 id="toc_0"&gt;ruhoh&lt;/h3&gt;
&lt;p&gt;&#x8FD9;&#x91CC;&lt;del&gt;&#x4E5F;&#x8BB8;&lt;/del&gt;&#x4F1A;&#x6210;&#x4E3A;&#x6211;&#x7B2C;&#x4E00;&#x7BC7;ruhoh&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x5148;&#x7F57;&#x5217;&#x4E00;&#x4E0B;&#x5E38;&#x7528;&#x7684;&#x547D;&#x4EE4;&#x5427;&#x3002;&lt;/p&gt;
&lt;pre&gt;&lt;code class=""&gt;rackup -p 9292  # &#x542F;&#x52A8; web &#x670D;&#x52A1;&#x5728; 9292 &#x7AEF;&#x53E3;
ruhoh page about.md  #&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x652F;&#x6301;&#x5B50;&#x76EE;&#x5F55; 
ruhoh post &amp;quot;The Greatest Post Ever&amp;quot; #&#x901A;&#x8FC7;&#x6807;&#x9898;&#x521B;&#x5EFA;&#x6587;&#x7AE0;&#xFF0C;&#x5C06;&#x4F1A;&#x751F;&#x6210; the-greatest-post-ever.md
ruhoh draft #&#x5FEB;&#x901F;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8349;&#x7A3F;&#xFF0C;&#x751F;&#x6210;untitled-draft-1.md 
ruhoh titleize #&#x5FEB;&#x901F;&#x4E3A;&#x8349;&#x7A3F;&#x6587;&#x4EF6;&#x547D;&#x540D;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x540E;&#x53F0;&lt;/p&gt;
&lt;pre&gt;&lt;code class=""&gt;http://localhost:9292/dash
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x7528;&#x4E86; ruhoh &#x5DF2;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x7528;&#x7684;&#x90FD;&#x662F;&#x4E9B;&#x788E;&#x7247;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x8FDB;&#x5C55;&#x5E76;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#xFF0C;&#x73B0;&#x5728;&#x57FA;&#x672C;&#x5B8C;&#x6210;&#x4F5C;&#x4E3A;&#x535A;&#x5BA2;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x6269;&#x5C55;&#x4E86; &lt;code&gt;note&lt;/code&gt; &#x548C; &lt;code&gt;diary&lt;/code&gt; &#x4E24;&#x4E2A;&#x65B0;&#x547D;&#x4EE4;&#xFF0C;&#x8FD8;&#x975E;&#x5E38;&#x521D;&#x6B65;&#xFF0C;&#x8981;&#x5B8C;&#x5584;&#x60F3;&#x5FC5;&#x5F97;&#x82B1;&#x4E0D;&#x5C11;&#x65F6;&#x95F4;&#x5427;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x7528;&#x9759;&#x6001;&#x7F51;&#x7AD9;&#x751F;&#x6210;&#x7CFB;&#x7EDF;&#x6765;&#x505A;&#x4E2A;&#x4EBA;&#x7684;&#x6587;&#x7AE0;&#x8F93;&#x51FA;&#x5E73;&#x53F0;&#x662F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x505A;&#x7684;&#x5C1D;&#x8BD5;&#x3002;&#x5F3A;&#x5927;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF1B;&#x6570;&#x636E;&#x5B89;&#x5168;&#xFF0C;&#x7EAF;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5907;&#x4EFD;&#x5230;&#x5404;&#x4E2A;&#x4E91;&#x5B58;&#x50A8;&#x5E73;&#x53F0;&#xFF0C;&#x5404;&#x4E2A;git&#x4ED3;&#x5E93;&#xFF1B;&#x65E0;&#x7F51;&#x7EDC;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x79BB;&#x7EBF;&#x7F16;&#x8F91;&#x548C;&#x9884;&#x89C8;&#xFF1B;markdown &#x7684;&#x6613;&#x8BFB;&#x6027;&#xFF1B;&#x8FD8;&#x6709;&#x5341;&#x8DB3;&#x7684;&#x53EF;&#x64CD;&#x7EB5;&#x611F;&#xFF1B;&#x5F53;&#x7136;&#x8981;&#x4EAB;&#x53D7;&#x8FD9;&#x4E9B;&#x597D;&#x5904;&#x7684;&#x524D;&#x63D0;&#x5C31;&#x662F;&#x5F97;&#x6709;&#x4E00;&#x4E2A;&#x6298;&#x817E;&#x5F97;&#x8D77;&#x7684;&#x5FC3;&#x3002;&lt;/p&gt;

&lt;p&gt;ruhoh &#x6548;&#x7387;&#x95EE;&#x9898;&#x6682;&#x4E14;&#x4E0D;&#x63D0;&#xFF0C;&#x73B0;&#x5728;&#x5185;&#x5BB9;&#x4E0D;&#x591A;&#x4E5F;&#x611F;&#x89C9;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x90E8;&#x7F72;&#x5230;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x73B0;&#x5728;&#x5728; webfaction &#x4E0A;&#x7528;&#x7740;&#x8FD8;&#x662F;&#x5F88;&#x8212;&#x670D;&#x7684;&#x3002;&#x53E6;&#x5916; plusjade &#x8FD8;&#x63D0;&#x4F9B;&#x514D;&#x8D39;&#x7684;&#x4E3B;&#x673A;&#x4F5C;&#x4E3A;&#x666E;&#x901A;&#x7684;&#x535A;&#x5BA2;&#x7528;&#x7EDD;&#x5BF9;&#x7EF0;&#x7EF0;&#x6709;&#x4F59;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x652F;&#x6301;&#x63D2;&#x4EF6;&#x3002;&#x53E6;&#x5916;&#x90E8;&#x7F72;&#x5230;&#x5176;&#x4ED6;&#x652F;&#x6301; ruby &#x4E91;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#x4E0A;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x5982; Heroku&#x3002;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x7684;&#x8BDD;&#xFF0C;&#x6BCF;&#x6B21;&#x66F4;&#x65B0;&#x90FD;&#x8981;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x518D;&#x4E0A;&#x4F20;&#x6570;&#x636E;&#xFF0C;&#x60F3;&#x60F3;&#x5C31;&#x5BB3;&#x6015;&#x3002;&lt;/p&gt;

&lt;p&gt;ruhoh &#x7684;&#x6269;&#x5C55;&#x8BBE;&#x8BA1;&#x4E5F;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF0C;&#x6216;&#x8005;&#x6211;&#x662F;&#x4E0D;&#x80FD;&#x660E;&#x767D;&#xFF0C;&#x5206;&#x4E3A; widgets&#xFF0C;themes &#x548C; plugins&#xFF0C;widgets &#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x53EF;&#x590D;&#x7528;&#x7684;&#x9875;&#x9762;&#x4EE3;&#x7801;&#x5757;&#xFF0C;plugins &#x5219;&#x662F;&#x7CFB;&#x7EDF;&#x6269;&#x5C55;&#xFF0C;&#x901A;&#x8FC7;ruby&#x811A;&#x672C;&#x5B9E;&#x73B0;&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x52A8;&#x6001;&#x7F51;&#x7AD9;&#x7684;&#x540E;&#x53F0;&#x903B;&#x8F91;&#x90E8;&#x5206;&#x3002;&#x800C;&#x50CF;&#x8BC4;&#x8BBA;&#x6A21;&#x5757;&#x3001;google prettify &#x8FD9;&#x4E9B;&#x8F7D;&#x5165;js&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7528; widgets &#x548C; themes &#x5B9E;&#x73B0;&#x5C31;&#x5F88;&#x5B8C;&#x7F8E;&#xFF0C;&#x751F;&#x6210; rss&#x3001;sitemap &#x5219;&#x53EF;&#x4EE5;&#x7528;plugins &#x5355;&#x72EC;&#x5B9E;&#x73B0;&#x3002;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x7528;&#x8D77;&#x6765;&#x53D1;&#x89C9;&#x8FD9;&#x4E09;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x672C;&#x535A;&#x7684; toc &#x548C; fancybox &#x529F;&#x80FD;&#x3002;&#x5C31;&#x5FC5;&#x987B;&#x7528; plugins &#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x6765;&#x6539;&#x52A8; redcarpet &#x751F;&#x6210;&#x7684;&#x76EE;&#x6807;&#x4EE3;&#x7801;&#x3002;&#x7136;&#x540E;&#x53C8;&#x5F97;&#x628A;&#x90A3;&#x4E9B;&#x7279;&#x5B9A;&#x7684; js &#x6587;&#x4EF6;&#x3001;html &#x4EE3;&#x7801;&#x5757;&#x653E;&#x5230; widgets &#x91CC;&#x9762;&#xFF0C;widgets &#x548C; plugins &#x7D27;&#x7D27;&#x7684;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x6837;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5FC5;&#x987B;&#x5F97;&#x540C;&#x65F6;&#x4F7F;&#x7528; plugins &#x548C; widgets &#xFF0C;&#x8FD9;&#x6837;&#x8FD8;&#x4E0D;&#x5982;&#x628A;&#x524D;&#x7AEF;&#x4EE3;&#x7801;&#x76F4;&#x63A5;&#x653E;&#x5230; themes &#x91CC;&#x6765;&#x7684;&#x6E05;&#x6670;&#x3002;&#x5F53;&#x7136;&#x5566;&#xFF0C;&#x50CF; toc &#x5B8C;&#x5168;&#x524D;&#x7AEF;&#x5B9E;&#x73B0;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x89C1;&#xFF1A;&lt;a href="http://brizzled.clapper.org/blog/2012/02/04/generating-a-table-of-contents-in-octopress/" title=""&gt;Generating a Table of Contents in Octopress&lt;/a&gt;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_1"&gt;&#x8BC4;&#x8BBA;&lt;/h3&gt;
&lt;p&gt;&#x9759;&#x6001;&#x535A;&#x5BA2;&#x7684;&#x8BC4;&#x8BBA;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x7B2C;&#x4E09;&#x65B9;&#x8BC4;&#x8BBA;&#x7CFB;&#x7EDF;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;ruhoh &#x662F;&#x7528; widgets &#x6765;&#x5D4C;&#x5165;&#x7B2C;&#x4E09;&#x65B9;&#x8BC4;&#x8BBA;&#x3002;&#x5167;&#x7F6E;&#x652F;&#x6301;disqus&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6211;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5BE6;&#x73FE;&#xFF0C;ruhoh &#x548C;  wordpress &#x7684;&#x76F8;&#x540C;&#x7BC7;&#x6587;&#x7AE0;&#x5171;&#x7528;&#x4E00;&#x500B;&#x8A55;&#x8AD6;&#xFF0C;disqus &#x63D0;&#x4F9B;&#x4E86;&#x9019;&#x7A2E;&#x53EF;&#x80FD;&#x6027; &lt;a href="http://help.disqus.com/customer/portal/articles/662547-why-are-the-same-comments-showing-up-on-multiple-pages-" title=""&gt;Why are the same comments showing up on multiple pages?&lt;/a&gt;&#x3002;wordpress &#x7684; disqus &#x63D2;&#x4EF6;&#x4F7F;&#x7528;&#x4E86; &#x6587;&#x7AE0;&#x7684; post&lt;em&gt;id &#x548C; guid&#x4F5C;&#x7232; disqus\&lt;/em&gt;identifier &#xFF0C;&#x6A21;&#x5F0F;&#x5982;&#x4E0B;&lt;/p&gt;
&lt;pre&gt;&lt;code class=""&gt;post_id + ' ' + guid
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x6240;&#x4EE5;&#x5728; &lt;a href="https://gist.github.com/3415268" title=""&gt;wp_to_ruhoh&lt;/a&gt; &#x91CC;&#xFF0C;&#x6211;&#x5C31;&#x9019;&#x5169;&#x500B;&#x5C6C;&#x6027;&#x4E5F;&#x4FDD;&#x7559;&#x4E0B;&#x4F86;&#x3002;&#x4F46;&#x662F; ruhoh &#x7684; widget &#x4E0D;&#x80FD;&#x8A2A;&#x554F; page &#x7684;&#x6578;&#x64DA;&#xFF08;&#x542D;&#x7239;&#x5440;&#xFF09;&#xFF0C;&#x898B; &lt;a href="https://github.com/ruhoh/ruhoh.rb/issues/52" title=""&gt;issue52&lt;/a&gt;&#x3002;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x628A;&#x4EE3;&#x78BC;&#x653E;&#x5230; theme &#x7684; layout &#x91CC;&#x3002;&#x5982;&#x4E0B;:&lt;/p&gt;
&lt;pre&gt;&lt;code class=""&gt;&amp;lt;div id=&amp;quot;disqus_thread&amp;quot;&amp;gt;&amp;lt;/div&amp;gt;
        &amp;lt;script type=&amp;quot;text/javascript&amp;quot;&amp;gt;
            /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO
        YOUR WEBPAGE * * */
            var disqus_title = '{{page.title}}';
            var disqus_identifier ='{{page.postid}} {{page.guid}}';
            var disqus_shortname = 'doousblog'; // required: replace example with your forum shortname

            /* * * DON'T EDIT BELOW THIS LINE * * */
            (function() {
                var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
                (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
            })();
        &amp;lt;/script&amp;gt;
        &amp;lt;noscript&amp;gt;Please enable JavaScript to view the &amp;lt;a href=&amp;quot;http://disqus.com/?ref_noscript&amp;quot;&amp;gt;comments powered by Disqus.&amp;lt;/a&amp;gt;&amp;lt;/noscript&amp;gt;
        &amp;lt;a href=&amp;quot;http://disqus.com&amp;quot; class=&amp;quot;dsq-brlink&amp;quot;&amp;gt;comments
            powered by &amp;lt;span class=&amp;quot;logo-disqus&amp;quot;&amp;gt;Disqus&amp;lt;/span&amp;gt;&amp;lt;/a&amp;gt;
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E; ruhoh &#x7684; post &#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x4EE5;&#x540E;&#x6362;&#x4E2A;&#x6807;&#x9898;&#xFF0C;&#x6216;&#x8005;&#x6362;&#x4E2A;&#x57DF;&#x540D;&#xFF0C;&#x90FD;&#x8981;&#x91CD;&#x65B0;&#x6574;&#x5408;&#x8BC4;&#x8BBA;&#xFF0C;&#x6700;&#x597D;&#x6BCF;&#x7BC7;&#x6587;&#x7AE0;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A; unique id &#x4F5C;&#x4E3A; disque_indentifier &#x4F7F;&#x7528;&#x3002;post &#x5DF2;&#x7ECF;&#x6709; id &#x5C5E;&#x6027;&#x4E86;&#xFF0C;&#x7528;&#x7684;&#x662F;&#x76F8;&#x5BF9;&#x7684;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_2"&gt;&#x4E3B;&#x9898;&lt;/h3&gt;
&lt;p&gt;&#x5173;&#x4E8E;&#x4E3B;&#x9898;&#xFF0C;&#x6298;&#x9A30;&#x4E86;&#x5E7E;&#x4E0B;&#xFF0C;&#x611F;&#x89BA;&#x76EE;&#x524D;&#x6211;&#x5F04;&#x7684;&#x9019;&#x500B;&#x4E3B;&#x984C;&#xFF0C;&#x4E26;&#x4E0D;&#x80FD;&#x767C;&#x63EE;bootstrap&#x4F5C;&#x7232;&#x811A;&#x624B;&#x67B6;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x7528;&#x5B83;&#x7684;&#x6805;&#x683C;&#x7CFB;&#x7EDF;&#x603B;&#x662F;&#x4E0D;&#x80FD;&#x628A;&#x8FB9;&#x680F;&#x8BBE;&#x8BA1;&#x5730;&#x8BA9;&#x4EBA;&#x6EE1;&#x610F;&#x3002;&#x4E0D;&#x904E;&#x54CD;&#x5E94;&#x5F0F;&#x5E03;&#x5C40;&#xFF08;responsive&#xFF09;&#x9019;&#x500B;&#x7279;&#x6027;&#x5BE6;&#x5728;&#x592A;&#x5F37;&#x4E86;&#xFF0C;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x4FDD;&#x8B49;&#x5728;&#x4E0D;&#x540C;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x8A2D;&#x5099;&#x4E0A;&#x90FD;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x6BD4;&#x8F03;&#x597D;&#x7684;&#x95B1;&#x8B80;&#x9AD4;&#x9A57;&#xFF0C;&lt;del&gt;&#x4E0D;&#x8FC7;&#x6211;&#x5206;&#x522B;&#x5B9E;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x5BFC;&#x822A;&#x680F;&#x5BF9;&#x5E94;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x548C;pc&#xFF0C;&#x4ECE;&#x8BED;&#x4E49;&#x4E0A;&#x8BB2;&#x8FD9;&#x4E2A;&#x505A;&#x6CD5;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&lt;/del&gt;&#x901A;&#x8FC7; bootstrap &#x6587;&#x6863;&#x4E3B;&#x9875;&#x6284;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x5BFC;&#x822A;&#x680F;&#x3002;&#x4E0D;&#x904E;&#x55AE;&#x55AE;&#x7528; bootstrap &#x7684;&#x90A3;&#x4E9B;&#x5C0F;&#x5DE5;&#x5177;&#x4E5F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#xFF0C;bootstrap &#x7684;&#x8A2D;&#x8A08;&#x771F;&#x7684;&#x5F88;&#x6F02;&#x4EAE;&#xFF0C;&#x50CF;&#x6211;&#x9019;&#x7A2E;&#x6C92;&#x6709;&#x524D;&#x7AEF;&#x7D93;&#x9A57;&#x7684;&#x78BC;&#x8FB2;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x5F88;&#x8212;&#x670D;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x7279;&#x522B;&#x9057;&#x61BE;&#x7684;&#x5C31;&#x662F;&#x4E3B;&#x984C;&#x5DE6;&#x908A;&#x90A3;&#x500B;&#x56FA;&#x5B9A;&#x7684;&#x5C0E;&#x822A;&#x6B04;&#x4E0D;&#x80FD;&#x5229;&#x7528;&#x5230;bootstrap&#x7684;&#x6805;&#x683C;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EA;&#x80FD;&#x7528;&#x539F;&#x4F86;&#x90A3;&#x7A2E;&#x65B9;&#x6CD5;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x4E3B;&#x9898;&#x7684;&#x8BBE;&#x8BA1;&#x5077;&#x7740;&#x4E0B;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x7F51;&#x7AD9;&#xFF0C;&#x8BF4;&#x597D;&#x542C;&#x5C31;&#x662F;&#x53C2;&#x8003;&#x4E86;-_-&#xFF0C;&#x80AF;&#x5B9A;&#x4E0D;&#x6B62;&#x8FD9;&#x4E9B;&#x7684;&#x53EA;&#x662F;&#x6211;&#x786E;&#x5B9E;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x4E86;&#x3002;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;a href="http://www.sitepoint.com/pure-css3-paper-curl/"&gt;http://www.sitepoint.com/pure-css3-paper-curl/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://yihui.name/cn/"&gt;http://yihui.name/cn/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://freemind.pluskid.org"&gt;http://freemind.pluskid.org&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x76F8;&#x6BD4; wordpress &#x90A3;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4E3B;&#x989C;&#x8272;&#x6362;&#x6210;&#x84DD;&#x8272;&#xFF0C;&#x53BB;&#x6389;&#x4E86;&#x5706;&#x89D2;&#xFF0C;&#x80CC;&#x666F;&#x591A;&#x4E86;&#x4E9B;&#x9634;&#x5F71;&#x3002;&#x611F;&#x89C9;&#x8FD8;&#x4E0D;&#x9519;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x53E6;&#x5916;&#x8FD8;&#x7528;&#x4E86;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;a href="http://dublue.com/plugins/toc/"&gt;http://dublue.com/plugins/toc/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://www.appelsiini.net/projects/lazyload"&gt;http://www.appelsiini.net/projects/lazyload&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://fancyapps.com/fancybox/"&gt;http://fancyapps.com/fancybox/&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="http://ajaxload.info/"&gt;http://ajaxload.info/&lt;/a&gt; &lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x4E5F;&#x6CA1;&#x529E;&#x6CD5;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#x4E86;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8FD9;&#x4E2A; ruhoh &#x4E3B;&#x9898;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x627E;&#x5230;&#xFF1A; &lt;a href="https://github.com/douo/douo.ruhoh.com/tree/master/themes/moon" title=""&gt;Moon&lt;/a&gt;&lt;/p&gt;
&lt;h3 id="toc_3"&gt;mustache&lt;/h3&gt;
&lt;p&gt;&#x4E00;&#x4E2A; Logic Less &#xFF08;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x7FFB;&#x8BD1;&#xFF0C;&#x76EE;&#x7684;&#x5927;&#x6982;&#x662F;&#x628A;&#x903B;&#x8F91;&#x8FD8;&#x7ED9;&#x4EE3;&#x7801;&#xFF0C;&#x8BA9;&#x6A21;&#x677F;&#x4FDD;&#x6301;&#x7B80;&#x6D01;&#x3002;&#x89C1; &lt;a href="http://stackoverflow.com/questions/3896730/whats-the-advantage-of-logic-less-template-such-as-mustache" title=""&gt;stackoverflow&lt;/a&gt;&#xFF09;&#x7684;&#x6A21;&#x677F;&#x8BED;&#x8A00;&#xFF0C;&#x6240;&#x4EE5;&#x540C;&#x6837;&#x4EE5;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x4E3A;&#x76EE;&#x6807;&#x7684; ruhoh
&#x91C7;&#x7528;&#x4E86;&#x5B83;&#x4F5C;&#x4E3A;&#x6A21;&#x677F;&#x8BED;&#x8A00;&#x3002;&#x53C2;&#x8003;&#x5B83;&#x7684; &lt;a href="http://mustache.github.com/#demo" title=""&gt;demo&lt;/a&gt; &#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x4E00;&#x4E0B;&lt;a href="/notes/coding/mustache" title=""&gt;&#x6211;&#x7684;&#x7B14;&#x8BB0;&lt;/a&gt;&#x3002;&lt;/p&gt;
&lt;h3 id="toc_4"&gt;Markdown&lt;/h3&gt;
&lt;p&gt;&#x7528;&#x4E86;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x7684; Markdown &#xFF0C;&#x767C;&#x73FE; Markdown &#x4E3B;&#x8981;&#x7684;&#x7F3A;&#x9677;&#x5C31;&#x662F;&#x592A;&#x7C21;&#x55AE;&#x4E86;&#xFF0C;&#x512A;&#x9EDE;&#x4E5F;&#x662F;&#x592A;&#x7C21;&#x55AE;&#x4E86;&#xFF0C;&#x771F;&#x662F;&#x77DB;&#x76FE;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x6298;&#x817E;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x80FD;&#x56DE;&#x907F;&#x5BF9;  markdown &#x7684;&#x8F6C;&#x6362;&#x5668;&#x505A;&#x4E00;&#x4E9B;&#x6539;&#x52A8;&#x3002;&#x5E78;&#x597D; redcarpet &#x6269;&#x5C55;&#x8D77;&#x6765;&#x5341;&#x5206;&#x65B9;&#x4FBF;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x6837;&#x5C31;&#x727A;&#x7272;&#x9ED8;&#x8BA4;&#x7528;&#x5E95;&#x5C42;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x8F6C;&#x6362;&#x5668;&#x7684;&#x6548;&#x7387;&#x3002;&#x53E6;&#x5916;&#x4E07;&#x4E0D;&#x5F97;&#x5DF2;&#x7684;&#x65F6;&#x5019;&#x51B3;&#x4E0D;&#x5BF9; Markdown &#x7684;&#x8BED;&#x6CD5;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x4F18;&#x5148;&#x7528;&#x4E00;&#x4E9B;&#x73B0;&#x6210;&#x7684;&#x6269;&#x5C55;&#x7248;&#x672C;&#xFF0C;&#x5E78;&#x597D;&#x73B0;&#x5728;&#x8FD8;&#x4E0D;&#x9700;&#x8981;&#x5230;&#x8FD9;&#x4E00;&#x6B65;&#x3002;&#x4E4B;&#x524D;&#x8003;&#x8651;&#x8FC7;&#x6362;&#x4E00;&#x4E9B;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x6807;&#x8BB0;&#x8BED;&#x8A00;&#xFF0C;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x770B;&#x8D77;&#x6765;&#x8FD8;&#x6CA1;&#x8FD9;&#x4E2A;&#x5FC5;&#x8981;&#x653E;&#x68C4; Markdown &#xFF0C;Markdown &#x5F88;&#x7C21;&#x6F54;&#x5F88;&#x6F02;&#x4EAE;&#xFF0C;&#x800C;&#x4E14;&#x90A3;&#x4E9B;&#x7B80;&#x5316;&#x4E5F;&#x662F;&#x6709;&#x5B83;&#x7684;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x89C9;&#x5F97;&#x4E0D;&#x723D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x662F;&#x5148;&#x575A;&#x6301;&#x4E00;&#x4E0B;&#x3002;&lt;/p&gt;

&lt;p&gt;&#x8FD9;&#x91CC;&#x6709;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#x5C0D;Markdown&#x7684;&#x6279;&#x8A55;:&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt; &lt;a href="http://blog.liancheng.info//why-i-hate-markdown" title=""&gt;Why I hate Markdown (and prefer reST)&lt;/a&gt;&lt;/li&gt;
&lt;li&gt; &lt;a href="http://freemind.pluskid.org/technology/the-unbearable-madness-of-static-blog-generators" title=""&gt;The Unbearable Madness of Static Blog Generators&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&#x4E0D;&#x8FC7; Markdown &#x7684;&#x8F6C;&#x4E49;&#x8BA9;&#x4EBA;&#x6293;&#x72C2;&lt;/p&gt;

&lt;p&gt;pandoc &#x589E;&#x5F3A;&#x7684; Markdown &#x8BED;&#x6CD5; &lt;a href="http://johnmacfarlane.net/pandoc/demo/example9/pandocs-markdown.html"&gt;http://johnmacfarlane.net/pandoc/demo/example9/pandocs-markdown.html&lt;/a&gt; &lt;/p&gt;
&lt;h3 id="toc_5"&gt;RSS &amp;amp; Sitemap&lt;/h3&gt;
&lt;p&gt;RSS &#x548C; Sitemap &#x57FA;&#x672C;&#x4E0A;&#x662F;&#x6BCF;&#x4E2A;&#x535A;&#x5BA2;&#x90FD;&#x5FC5;&#x5907;&#x7684;&#x4E86;&#x3002;&#x65B0;&#x7248;&#x7684;ruhoh &#x5DF2;&#x7ECF;&#x5185;&#x7F6E; rss &#x751F;&#x6210;&#x63D2;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x6709;&#x4E0D;&#x5C11;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x53C2;&#x8003;&#x4E86;wordpress &#x7684; rss &#x6539;&#x8FDB;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x89C1; &lt;a href="https://gist.github.com/3736010" title=""&gt;rss.rb&lt;/a&gt;&#xFF0C;rss&#x7684;&#x6807;&#x51C6;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#xFF0C;&#x5E0C;&#x671B;&#x5B9E;&#x73B0;&#x4E0D;&#x8981;&#x4E0D;&#x4F26;&#x4E0D;&#x7C7B;&#x3002;&lt;/p&gt;

&lt;p&gt;Sitemap &#x751F;&#x6210;&#x6211;&#x7528;&#x7684;&#x662F;&lt;a href="https://github.com/crhan" title=""&gt;crchan&lt;/a&gt;&#x7684;&lt;a href="https://gist.github.com/3705998" title=""&gt;Ruhoh Sitemap Generator&lt;/a&gt;&#xFF0C;&#x6839;&#x636E;wordpress&#x7684;Sitemap&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x505A;&#x4E86;&#x4E9B;&#x6539;&#x52A8;&#xFF1A;&lt;a href="https://gist.github.com/3736089" title=""&gt;&#x6539;&#x52A8;&#x7248;&lt;/a&gt;&lt;/p&gt;
&lt;h3 id="toc_6"&gt;&#x642C;&#x5BB6;&lt;/h3&gt;
&lt;p&gt;&#x6700;&#x540E;&#x8BF4;&#x8BF4;&#x642C;&#x5BB6;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x60F3;&#x8981;&#x65E0;&#x75DB;&#x5730;&#x5C06; wordpress &#x7684;&#x6587;&#x7AE0;&#x8F6C;&#x6362;&#x5230; ruhoh &#x4E0A;&#x662F;&#x4EF6;&#x5341;&#x5206;&#x75DB;&#x82E6;&#x7684;&#x4E8B;&#x3002;&#x6298;&#x817E; ruhoh &#x6709;&#x4E0D;&#x5C11;&#x65F6;&#x95F4;&#x5C31;&#x662F;&#x5728;&#x6298;&#x817E;&#x8FD9;&#x4E2A;&#x8F6C;&#x6362;&#x811A;&#x672C;&#x3002;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x57FA;&#x672C;&#x4E0A;&#x53EF;&#x4EE5;&#x5B8C;&#x6210; 87.53% &#x7684;&#x8F6C;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x5305;&#x62EC;&#x5C06;&#x6587;&#x7AE0;&#x8F6C;&#x6362;&#x4E3A; markdown &#x683C;&#x5F0F;&#xFF0C;&#x611F;&#x8C22; pandoc &#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x505A;&#x4E86;&#x4E0D;&#x5C11; hack&#x3002;&#x6700;&#x6298;&#x817E;&#x4EBA;&#x7684;&#x5C31;&#x662F; codecolorer &#x8FD9;&#x8D27;&#xFF0C;&#x77ED;&#x6807;&#x7B7E;&#xFF0C;&#x957F;&#x6807;&#x7B7E;&#xFF0C;&#x5404;&#x79CD;&#x6DF7;&#x7528;&#xFF0C;&#x592A;&#x53EF;&#x6015;&#x4E86;&#xFF0C;&#x5DEE;&#x70B9;&#x60F3;&#x91CD;&#x65B0;&#x5B9E;&#x73B0;&#x5B83;&#x7684;&#x5F15;&#x64CE;&#xFF0C;&#x6700;&#x540E;&#x5F53;&#x7136;&#x8FD8;&#x662F;&#x653E;&#x5F03;&#xFF0C;&#x7528;&#x4EBA;&#x5DE5;&#x4FEE;&#x6539;&#x4E00;&#x4E9B;&#x4F8B;&#x5916;&#xFF0C;&#x50CF;&#x662F;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF1A;&lt;a href="/2010/08/03/codecolorer-doc-cn" title=""&gt;CodeColorer&#x4E2D;&#x6587;&#x5E2E;&#x52A9;&lt;/a&gt;&lt;/p&gt;

&lt;p&gt;&#x811A;&#x672C;&#x7531;Jekyll &#x7684;wordpressdotcom &#x4FEE;&#x6539;&#x800C;&#x6765;&#xFF0C;&#x6839;&#x636E;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x9488;&#x5BF9;&#x6027;&#x7684;hack&#xFF0C;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9002;&#x7528;&#x6027;&#x3002;&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x627E;&#x5230;&#xFF1A; &lt;a href="https://gist.github.com/3415268" title=""&gt;wp_to_ruhoh&lt;/a&gt;&lt;/p&gt;
&lt;h3 id="toc_7"&gt;&#x90E8;&#x7F72;&lt;/h3&gt;
&lt;p&gt;webfaction &#x771F;&#x5FC3;&#x4E0D;&#x9519;&#x3002;&#x7ED9; git &#x52A0;&#x4E2A;&#x94A9;&#x5B50;&#xFF0C;&#x7528; post-receive &#x89E3;&#x51B3;&#x5168;&#x90E8;&#x95EE;&#x9898;&lt;/p&gt;
&lt;pre&gt;&lt;code class="bash"&gt;#!/bin/bash

HOME=/home/xxx
LOG=$HOME/ruhoh.log
BUILD_DIR=$HOME/tmp/
SITE_DIR=$BUILD_DIR/compiled/
DEPLOY_DIR=$HOME/deploy/
source $HOME/.rvm/scripts/rvm
date &amp;gt;&amp;gt;  $LOG 
unset GIT_DIR
cd $BUILD_DIR
PATH=$HOME/douo-ruhoh/bin:$PATH  #use custom ruhoh to compile
#echo $PATH &amp;gt;&amp;gt;  $LOG
git pull  &amp;gt;&amp;gt;  $LOG
which ruhoh &amp;gt;&amp;gt; $LOG
ruhoh compile &amp;gt;&amp;gt; $LOG
rsync -a --delete-after $SITE_DIR $DEPLOY_DIR &amp;gt;&amp;gt;  $LOG
&lt;/code&gt;&lt;/pre&gt;&lt;h3 id="toc_8"&gt;&#x5176;&#x4ED6;&lt;/h3&gt;&lt;h4 id="toc_9"&gt;Mathjax&lt;/h4&gt;
&lt;p&gt;Mathjax&#x7684;&#x4F7F;&#x7528;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF0C;&#x76F4;&#x63A5;&#x5728;&#x9801;&#x9762;&#x5D4C;&#x5165;&#x8173;&#x672C;&#x5C31;&#x884C;&#xFF0C;&#x7136;&#x5F8C;&#x901A;&#x904E;&#x4E00;&#x500B; widgets &#x4F86;&#x8F09;&#x5165; mathjax &#x7684;&#x8173;&#x672C;&#x3002;&#x5C31;&#x53EF;&#x4EE5;&#x5C55;&#x793A;&#x516C;&#x5F0F;&#x4E86;&#x3002;&#x5173;&#x952E;&#x662F;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x63D2;&#x5165;&#x516C;&#x5F0F;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x521A;&#x597D; plusjade &#x6269;&#x5C55;&#x4E00;&#x4E0B;&#x8F6C;&#x6362;&#x5668;&#x63D2;&#x4EF6;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x8A9E;&#x6CD5;&#xFF1A;&lt;a href="https://gist.github.com/2699636" title=""&gt;mathjax.rb&lt;/a&gt;&#x3002;&lt;/p&gt;
&lt;script type="math/tex; mode=display"&gt;
        e^{i\pi} + 1 = 0

        &lt;/script&gt;
&lt;p&gt;&#x6211;&#x8003;&#x8651;&#x662F;&#x5426;&#x8981;&#x4E3A;&#x9875;&#x9762;&#x52A0;&#x5165;&#x4E00;&#x4E2A;Mathjax&#x5F00;&#x5173;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x5206;&#x535A;&#x6587;&#x90FD;&#x65E0;&#x9700;&#x7528;&#x5230;Mathjax&#x3002;&#x53E6;&#x5916;&#xFF0C;Mathjax &#x597D;&#x50CF;&#x4F1A;&#x4E0D;&#x5B9A;&#x65F6;&#x7684;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x5E03;&#x5C40;&#x9519;&#x4E71;&#x7684;&#x95EE;&#x9898;&#x3002;&lt;/p&gt;
&lt;h4 id="toc_10"&gt;&#x81EA;&#x52A8;&#x5237;&#x65B0;&lt;/h4&gt;
&lt;p&gt;&#x770B;&#x4E86; pluskid &#x7684;&lt;a href="http://freemind.pluskid.org/technology/the-unbearable-madness-of-static-blog-generators/" title=""&gt;&#x6587;&#x7AE0;&lt;/a&gt;&#xFF0C;&#x6211;&#x4E5F;&#x8DDF;&#x7740;&#x5B9E;&#x73B0;&#x4E86;&#x4FDD;&#x5B58;&#x7684;&#x65F6;&#x5019;&#x81EA;&#x52A8;&#x5237;&#x65B0;&#x9875;&#x9762;&#x3002;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x51E0;&#x4E2A;&#x4E1C;&#x897F;&lt;/p&gt;

&lt;ul&gt;
&lt;li&gt;&lt;a href="https://github.com/guard/guard" title=""&gt;guard&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/johnbintz/rack-livereload" title=""&gt;rack-livereload&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/guard/guard-livereload" title=""&gt;guard-livereload&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;p&gt;&lt;a href="https://github.com/guard/guard" title=""&gt;guard&lt;/a&gt;&#x662F;&#x4E00;&#x4E2A;&#x76D1;&#x542C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x53D8;&#x52A8;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&lt;a href="https://github.com/johnbintz/rack-livereload" title=""&gt;rack-livereload&lt;/a&gt; &#x5B9E;&#x73B0;&#x4E86;&#x81EA;&#x52A8;&#x5237;&#x65B0;&#x3002;&#x5B89;&#x88C5;&#x548C;&#x4F7F;&#x7528;&#x770B;&#x4E00;&#x4E0B;&#x5404;&#x81EA;&#x7684; readme &#x8FD8;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x660E;&#x767D;&#x7684;&#xFF0C;&#x4F46;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5DE5;&#x4F5C;&#x6211;&#x4E5F;&#x6CA1;&#x5F04;&#x6E05;&#x695A;&#xFF0C;&#x53CD;&#x6B63;&#x4E0D;&#x7528;&#x6539;&#x52A8;ruhoh&#x7684;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#xFF0C;&#x5F88;&#x65B9;&#x4FBF;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x5728; windows &#x4E0B;&#x5B89;&#x88C5; &lt;a href="https://github.com/guard/guard-livereload" title=""&gt;guard-livereload&lt;/a&gt; &#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x539F;&#x56E0;&#x662F;EventMachine 0.12.10 &#x4E0D;&#x80FD;&#x5728;&#x8DD1;&#x7740; ruy 1.9.2+ &#x7684;windows&#x4E0A;&#x5DE5;&#x4F5C;&#x3002;&#x7528; pre-release &#x7684;&#x7248;&#x672C;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8BA8;&#x8BBA;&#x5728;&lt;a href="http://stackoverflow.com/questions/6927907/ruby-problem-installing-eventmachine-under-windows-7#" title=""&gt;stackoverflow&lt;/a&gt; &#x4E0A;&#x3002;&lt;/p&gt;
&lt;pre&gt;&lt;code class=""&gt;gem install eventmachine --pre
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;&#x53D1;&#x73B0; guard &#x8FD9;&#x8D27;&#x5728; win7 cygwin &#x4E0B;&#x6709;&#x65F6;&#x8FDB;&#x7A0B;&#x5360;&#x7528;CPU 100%&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x3002;&lt;/p&gt;
</description>
    </item>
  </channel>
</rss>
